[
    {
        "address":"340 E Flamingo Rd",
        "attributes":{
            "BikeParking":"True",
            "Caters":"False",
            "OutdoorSeating":"True",
            "BusinessAcceptsCreditCards":"True",
            "ByAppointmentOnly":"False",
            "GoodForMeal":"{'dessert': False, 'latenight': False, 'lunch': False, 'dinner': False, 'brunch': False, 'breakfast': False}",
            "WiFi":"u'free'",
            "RestaurantsTakeOut":"True",
            "BusinessParking":"{'garage': False, 'street': False, 'validated': False, 'lot': True, 'valet': False}",
            "RestaurantsDelivery":"False",
            "RestaurantsPriceRange2":"1"
        },
        "business_id":"q3kk9PciPb6LpwurlE9eVg",
        "categories":"Coffee & Tea, Food",
        "city":"Las Vegas",
        "hours":{
            "Monday":"4:30-17:0",
            "Tuesday":"4:30-0:0",
            "Wednesday":"4:30-0:0",
            "Thursday":"4:30-0:0",
            "Friday":"4:30-0:0",
            "Saturday":"4:30-0:30",
            "Sunday":"4:30-18:0"
        },
        "is_open":1,
        "latitude":36.11471,
        "longitude":-115.157467,
        "name":"Starbucks",
        "postal_code":"89109",
        "review_count":115,
        "stars":3.5,
        "state":"NV",
        "reviews":[
            {
                "cool":4,
                "date":"2016-11-10 00:11:48",
                "funny":4,
                "review_id":"e1mjXzIuWW9jBbAaw4tPpg",
                "stars":1,
                "text":"Quite possibly the worst Starbucks location I've been to. There were only 2 cars in front of me at the drive-through so, no, not busy at 2pm. I figured I'd grab some coffee before I fall asleep during a 30-minute drive and this location was on the way after leaving UNLV.\n\nI ordered a GRANDE mocha frappuccino with a shot of espresso, no whipped cream, and chocolate syrup on top. I repeated myself at least 3 times because the lady at the drive through kept saying the wrong thing. What they gave me the first time was a mocha frappuccino with whipped cream and chocolate chips - which was not what I asked for. The lady seemed annoyed. Within 10 seconds, she hands me a TALL (all 2/3 of it, so generous!) mocha frappuccino, no whipped cream, and chocolate syrup on top.\n\nThis would be the last time I'd go to this location. Service and product were both sub par.",
                "useful":7,
                "user_id":"tH0uKD-vNwMoEc3Xk3Cbdg"
            },
            {
                "cool":0,
                "date":"2018-05-08 19:17:24",
                "funny":0,
                "review_id":"SIOLi_9mKVK7mf4N5JGoVA",
                "stars":2,
                "text":"I am sooo upset that I ordered 2 blonde vanilla latte's via mobile app. When I went in after sitting outside for 10 minutes, they guy made me 2 americanos. I ended up waiting for my vanilla latte's and I should have tasted them before I left but I was in a hurry at that point to get to work. I get to work and the latte was literally milk and coffee, no flavor and it tasted so bad I threw it out.",
                "useful":0,
                "user_id":"YsL6vAU_COmCnP0iZk0PGA"
            },
            {
                "cool":0,
                "date":"2015-07-17 11:07:01",
                "funny":0,
                "review_id":"ufjQRLGy7Dz4kEW32PVmKQ",
                "stars":4,
                "text":"I'm comfortable at this location. Fact it's close and open until midnight are positives. The employees as a whole are very good.",
                "useful":0,
                "user_id":"IM4RlcY27r36LWQvjUvLrQ"
            },
            {
                "cool":0,
                "date":"2017-12-03 15:45:26",
                "funny":1,
                "review_id":"Q7WKBx_GU87y709FzQg1Lw",
                "stars":1,
                "text":"If I could, I would give this location NO stars. Unfortunately I have to give at least 1 in order to write a review and warn people about the extremely disrespectful employees at this location. I absolutely HATE this location. I visit starbucks a LOT - on a daily basis (sometimes 2 to 3 times a day), and in all the time I have been a customer with them I have never had such a horrible, humiliating experience. I went through the drive-thru to buy two toffee nut lattes with caramel drizzle around the cup, and a steak tomatillo wrap. When I payed  and received my items, I looked over my receipt and saw that I was charged $0.50 each just for the toffee nut syrup. At first it wasn't a big deal, I just thought \"oh that's new, I don't remember ever being charged for the specific syrup before at any other location.\" So I politely asked a woman named May in the window, \"when did they start charging for the toffee nut syrup? I've never seen that before.\" She rolled her eyes at me, gave me a dirty look, said \"well we do here\", and turned her back to me. I have already had problems with employees in the window giving me attitude at this location once before. I parked out front, went inside, and asked an employee if they could please give me the name of the woman in the window, because I needed it in order to file a complaint with the manager. Now, keep in mind, I have seizures and I stutter when my stress is increased. The male employee turned and laughed through my stuttering as I asked this and told me her name was May. He then continued chuckling and told me, \"you can complain all you want - nobody cares.\" Word. For. Word. No exaggeration. I couldn't take being talked down to there anymore, so I left. I went out to my car and called inside the store from there. A man picked up the phone, and I asked if I could please speak with the manager on shift. He replied, \"yeah that's me, this is my shift.\" I recognized his voice and asked him, \"are you the man I just talked to inside the store? The one who gave me May's name?\" He confirmed it was him I spoke to. So I asked him, \"Oh alright, so what is your name? And you said you're the manger? Because I will be talking to Lauren, the other manager, as soon as I can and telling her about what I experienced today.\" (Lauren is a very nice and polite manager I met the LAST time I had a problem here). He replied, \"My name is Gerardo, but no I'm not a manager.\" I told him, \"Wait a minute, but the first thing I asked when I called was if I was speaking to a manager, and you told me yes.\" He responded, \"No I didn't, because I'm not a manger. We don't have a manager working today.\" So long story short, I highly recommend never coming here. This all was completely avoidable and there was absolutely no reason I should've been treated this way.",
                "useful":1,
                "user_id":"xCNOowgwaoYGR4sZ7o70Yg"
            },
            {
                "cool":5,
                "date":"2014-10-13 15:35:22",
                "funny":3,
                "review_id":"ov9aMRLhVyflKfbQWa-xKA",
                "stars":5,
                "text":"This update is long overdue. I've been visiting this location when I come into town for business or pleasure which is at least once a month.\n\nI usually arrive in the am and the staff here is what make this location so unique and special. Daily customers which I've met two - get their coffee brought to them in regular coffee cups! The staff knows their clients so well they are preparing their orders before they reach the counter. This location also offers the Starbucks Reserve products and has a clover machine for preparation of one cup of reserve at a time!\n\nThank you to entire staff at this location for your outstanding service & quality!",
                "useful":5,
                "user_id":"o4tYl3Hz0oDfpNn4k02DCw"
            },
            {
                "cool":0,
                "date":"2017-03-05 06:32:50",
                "funny":0,
                "review_id":"MUuwKB-t9zy0bfkagYNmUg",
                "stars":5,
                "text":"This is a good starbucks, since it's open late. I think it also makes pretty good use of the space that it has, and it's usually not too busy. Not in my experience, at least. Good place to bring a laptop and put headphones in while enjoying a drink. No problems with the service.",
                "useful":0,
                "user_id":"KYX7kJDSnT2nDBH7SctIfQ"
            },
            {
                "cool":0,
                "date":"2017-08-09 13:46:43",
                "funny":0,
                "review_id":"Pksim-1o7aRocY3NNbv-gA",
                "stars":1,
                "text":"I normally go to this Starbucks once a week before 6:30am. It's convenient cause it's near the strip without paying the hefty prices! Usually they are great with my order. Never got a complaint from me...until today.\n\nI admit I do have a complex drink order. But I'm more than happy to repeating it 2 to 3 times to make sure they get it right. After saying my order to the older lady at the drive thru. She seemed hesitant but told me the price. I get iced espresso with added flavoring, soy and extra ice. This time around I asked for one shot less so I wouldn't be jittery; yet the price was more than my normal order. I assumed they raised the prices again. Pulled forward. Paid my drink and drove off.\n\nIt wasn't until I drove to work that I looked at my drink and saw that the label on my drink said macchiato which explained why the price shot up about 75 cents. After taking a sip or two, it tasted so bitter compared to what I normally get. So I called to speak with the manager. The manager seemed nice enough asking what drink I had. Then I heard the same lady from the drive thru arguing in the background saying it wasn't true. That it was the right drink. She just charged me wrong but I got what I ordered. She proceeded to get on the phone and explain this to me. I was clocking into work so I didn't want to argue over a few cents with someone that was obviously acting defensive.\n\nAfter trying to drink a little longer I realize that there was no flavoring at all. Which I paid more to be put in the drink in the first place.\n\nI'm going to wait until the manager. I was a barista at Starbucks and never did I even think about getting on the phone and arguing with a customer.\n\nI will now take the longer route to go to a different Starbucks. At least that one has some customer service.",
                "useful":2,
                "user_id":"HQUx_q8IhSrJX3GPdUvO_g"
            },
            {
                "cool":1,
                "date":"2015-07-30 01:40:29",
                "funny":1,
                "review_id":"rVw4jojn6ElbQuFPVmeXRg",
                "stars":4,
                "text":"Came to this location before work the other day, and since there was like 4 cars in front of me I thought it was going to take for ever. But surprisingly it was really quick and my order was done correctly. The employee was really nice and friendly. I would love to come back here again.",
                "useful":3,
                "user_id":"SoiacX2r2mvHqIh3GgRMUw"
            },
            {
                "cool":0,
                "date":"2016-01-18 07:03:02",
                "funny":0,
                "review_id":"nKaBZT6jkaeCDhY-TePsAw",
                "stars":4,
                "text":"What can I say about starbucks? Starbucks is starbucks. Now location is another thing. Location here is fine. Size is good. I came here to read a few books and study and the noise was quiet to moderate. The place was kept clean. I don't remember if this is the location that just had the hand drier in the bathroom, usually they also offer paper towels.\n\nThe drinks are pretty universal when you're talking about starbucks. I get the caramel macchiato and it is done. The staff is friendly as well. I also tried one of their fraps which was decent. Another note, I shouldn't complain about starbucks prices but they are relatively expensive. And the line can get a little long.\n\nIn terms of pastries, they are average to good. Starbucks always changes up their pastries so its hard to judge the places. For instance, I used to love getting the chocolate cake pop. Some places have them others don't. Another thing was the rice krispy treats, they seemed to have done away with that completely and now only have the factory wrapped ones which aren't nearly as good. \n\nOther than this I don't have much to say. If you are looking for good coffee and a nice place to read then this is a good place.",
                "useful":0,
                "user_id":"BGZcv3B3mlofVJYG_TTsMw"
            },
            {
                "cool":0,
                "date":"2016-04-23 06:20:29",
                "funny":0,
                "review_id":"RSl8cBW70-Gf0ptH2MzAEw",
                "stars":4,
                "text":"I love it ..so nice staff nice hangout place",
                "useful":0,
                "user_id":"HIIsX5PndKxf5GZtXwprhw"
            },
            {
                "cool":0,
                "date":"2014-02-06 18:18:34",
                "funny":0,
                "review_id":"LMVVcJw8MY-ovxU-DeKXIA",
                "stars":4,
                "text":"The baristas w/o the Jeremy Piven headsets are the most customer service oriented. (IMHO). I guess the headsets are an attempt to be efficient, hip, and techie. But plain ole customer service is dipping slightly. I guess SBUX, once the Pike Place Market of the world, is trying to be the Tiffany/Prada of the world. \nStill, when I travel, I seek out the chain because it is fairly consistent.",
                "useful":0,
                "user_id":"dA7smMo-z6VNmgNzyd640Q"
            },
            {
                "cool":0,
                "date":"2015-04-02 01:55:26",
                "funny":0,
                "review_id":"QaFQDfAZhm3o3xZE1RViOg",
                "stars":1,
                "text":"Wow, who manages this place?  My simple coffee with room for cream was filled to the brim (had to dump some out), but no big deal.  Then my daughter's was made completely wrong (not even close) so they had to remake it but didn't bump it to the front of the queue.  Note that she works at Starbucks so knows how they are supposed to handle this!  Then they made it wrong again!  By that time we just left, not to come back again.  If you think this is a good starbucks you really don't know what the hell you're doing.",
                "useful":0,
                "user_id":"0dOZdotudoK5B54p815q9g"
            },
            {
                "cool":0,
                "date":"2018-08-05 12:50:36",
                "funny":0,
                "review_id":"bepXh7BcDm9kLULJkRYg8A",
                "stars":1,
                "text":"What's up with this Starbucks ? It's sooooo expensive! It's also hard to find and their parking lot is weird kind of reminds me of a maze. For 1 tall frappe and 1 venti frapp... total came to nearly $12. Wow, I won't be back!",
                "useful":0,
                "user_id":"AjQVpSaAihkhQuzszKHzZw"
            },
            {
                "cool":1,
                "date":"2014-02-07 19:42:54",
                "funny":1,
                "review_id":"zd7HkQ0DPgt2QGKYvzgJmQ",
                "stars":4,
                "text":"Seems this particular SBUX thrives on a crowd. The bigger the crowd, the more efficient the staff becomes. Gotta love that! I was maybe 15th in line- but it moved surprisingly quickly. The outside table clean-up is, at best, meh. \nYou get yer caffeine buzz AND yer crowd buzz at this joint.\nHowever, if you order an espresso, and ur eligible for a free re, you gotta get one of their blended coffees- no free re on anything else. To me, their blended coffees are ehh, no good. If you like ur coffee foo-foo'd up, mbe they're alright. I like mine like I like the night-black. No foo-foo.",
                "useful":1,
                "user_id":"dA7smMo-z6VNmgNzyd640Q"
            },
            {
                "cool":0,
                "date":"2016-07-17 21:40:48",
                "funny":0,
                "review_id":"hGDmXMlhlS3y7Q70XYGXFA",
                "stars":5,
                "text":"I have to say they are Number one plays. \nGrate service............ \nI will ceep coming over evryday......\nI will recommend this place allways.........",
                "useful":0,
                "user_id":"ttV7LFe4atjb9c7MZHn7Bw"
            },
            {
                "cool":6,
                "date":"2015-04-17 21:29:29",
                "funny":4,
                "review_id":"GZ6ZXNUHDKaHa3MDOFvQfg",
                "stars":5,
                "text":"Best of them all. Super friendly and fast baristas serve your coffee drink here in this still brand new location. This Starbucks serves as a a/c-ed shelter when the heat is out and as a convenient checkpoint with their drive-through window. \n\nThe industrial/retro design inside is beautiful and the place spacious. The menu offers all the latest Starbucks drinks, including clover coffee.\n\nState of the art!",
                "useful":6,
                "user_id":"HKC-j6ShF_wUfB0q1BH5cw"
            },
            {
                "cool":0,
                "date":"2016-05-09 15:52:32",
                "funny":1,
                "review_id":"eGughuX80FFgP75HX6h-Ig",
                "stars":1,
                "text":"This Starbucks has the rudest employees out of any Starbucks I've been to.  Will never be back to this location.",
                "useful":1,
                "user_id":"R1WlWAzjeMkAg4keap7K4g"
            },
            {
                "cool":0,
                "date":"2017-04-21 19:49:08",
                "funny":0,
                "review_id":"vfbZciKW8LUSHAaObWaQ-w",
                "stars":1,
                "text":"If I can give this place a complete ZERO RATING I would but I can't so there's that. I literally have gone here three time first two times weren't bad at all UNTIL today it was so bad I have to write a review because I'm not coming here again. We pull up to the window and tell this lady our order which I don't think she was listening because she repeated it and was not what we ordered. THEN we repeat the order and she still doesn't get it so I from the passenger side had to shout over my sister to correct this order. After this happened I was like okay well... let's see how the order goes. First I get my strawberry refresher which one had NO strawberries, I only asked her if she would be able to add strawberries she looked at me as if I asked her to give me my money back. Second she gives us the grande drink which the cap of it \"DOESNT FIT\" mind you we are in the car and the drink had whip cream up top. So I asked is there anything that fits the cap she AGAIN looked at me like I was in the wrong. She took it back and said oh I there's nothing that fits, so in my defensive this can't be the first time this has happened people must be complaining about that cause whip cream spilled when she handed us the drink. Not to mention she gave me the food I ordered and then said, \"oh never mind give that back that's not your order.\" Literally just wanted to leave but they still had my damn drink putting strawberries in it during this whole process. SUPER ANNOYED. Not coming back!",
                "useful":0,
                "user_id":"maXQVBpMH4mbwMgHQtr7Ow"
            },
            {
                "cool":9,
                "date":"2014-01-01 00:29:31",
                "funny":9,
                "review_id":"tEpHLvZt8dhsGMD3Xl2IvA",
                "stars":4,
                "text":"Re-locating from the location at 395 Hughes Center Drive where Starbucks hold the memories to remember and recall.  My favorite Starbucks Coffee Shop that just melts me like butter on pancakes, like whipped cream over hot chocolate is now in a newer, bigger location transferring from 395 Hughes Center Dr. to this location by the corner of Hughes Center Parkway, on E. Flamingo Road. So it is a welcoming place as it is a stand-alone building that's newly-built. Wide, panoramic windows lets in the light for a brighter feel with roadside views. Oh, to just people-watch or rather vehicles-passing-by-watch for the watcher in you! As expected, the effervescence of hot brewed coffee permeates the air and lingers to my nostrils' delight! Jazz music adds to the vibe, allowing my senses to relax and imbibe on a beverage of my choice. Take a pick from nice brewed green hot tea, decaffeinated coffee, cool iced tea, delicious coffee, and  various beverages. Choices of baked goods from bagels, to cakes as well as sandwiches and an assortment of desserts, bagels, chips, nuts, meal wraps, dried fruit to whet your appetite. Imbibe, linger, socialize over delicious beverages indoors or outdoors on its small patio under green umbrellas for delighting in the fresh air. Also a breeze of a gain from getting feet off the ground just to obtain the beverage while on-the-run via its Drive-Thru service. Starbucks looks like a little castle surrounded by spaceousness. Ample parking surrounds the new contemporary building. Coffee Hours are from Mondays - Sundays at 4:30 AM - 12:00 AM...that's great hours for the owls and early risers. Coffee servers are ever attentive and happy to serve. Sip your favorite beverages or Coffee, anyone?",
                "useful":9,
                "user_id":"l1CtGHiqB349YrmxjIcgng"
            },
            {
                "cool":0,
                "date":"2017-06-29 07:06:56",
                "funny":0,
                "review_id":"mg5TCeTDtLSY9WH4-dHGkA",
                "stars":2,
                "text":"I really hate leaving a bad review for places but I literally come here EVERYDAY since I live 2 blocks away and the drive thru is convenient. Everyday I order the same exact 2 drinks and everyday they MESS IT UP! If it's not one drink it's the other. I even ask them to say it back to me to be sure that when I get to the window it's  correct.  I've gotten attitude from one of the employees about it the others typically just fix it. But it really is not my fault they can't get it right the first time even after I've told them twice.",
                "useful":1,
                "user_id":"Vag0RBu8MOJuswTIV3aV_A"
            },
            {
                "cool":36,
                "date":"2015-07-30 02:08:38",
                "funny":31,
                "review_id":"OW2RDiTh9nY7va3HHwo4HA",
                "stars":5,
                "text":"I was meeting someone in the area and arrived a bit too early, so I spent the extra time I had at this Starbucks location. I was impressed with the amount of space this one offers and how friendly, helpful and quick the service was that I received. Inside is kind of long and narrow and they have plenty of tables scattered about and a long bar with stools as well a nice long table to that's hard to miss as you walk in. They had plenty of fresh fruit available and the usual pastries. The inside was a bit crowded, so after sitting inside for about 10 minutes I decided to move out to the patio since it was a nice afternoon outside. They have tables and chairs outside the front door and then a spacious patio on the side on the building with tables and chairs. If you are one of those who loves a Starbucks with a drve-thru then you will be happy to find out that is an option here as well. All in all this is a solid location and am glad I stopped by.",
                "useful":40,
                "user_id":"Fv0e9RIV9jw5TX3ctA1WbA"
            },
            {
                "cool":0,
                "date":"2017-11-20 19:48:45",
                "funny":0,
                "review_id":"9oaP-RpxGx9jTsdmgb0h0Q",
                "stars":5,
                "text":"This store rocked this morning!!!  -Vegas Baby!  From the register, to the staff making the drinks, the most efficient operation I've seen at a Starbucks. At the register, I placed three food orders ,three drinks, moved credit from a gift card to a Gold card, receipts given, all handled very quickly. The baristas got the drinks prepared quickly, correctly and efficiently. I was very impressed! I thanked the staff and told them so.",
                "useful":0,
                "user_id":"ZL2OqGvRlTpsB-77PPRwFQ"
            },
            {
                "cool":0,
                "date":"2017-01-05 07:44:34",
                "funny":0,
                "review_id":"AAp2wiaYUrEEucmko_y5WA",
                "stars":5,
                "text":"Michelle was our barista and served us with a smile. She took excellent care of us and was friendly and helpful. I'd go out of my way to stop at this Starbucks again.",
                "useful":0,
                "user_id":"4sTNXclR6TKyIpIS_q6YoA"
            },
            {
                "cool":0,
                "date":"2016-08-27 19:15:06",
                "funny":0,
                "review_id":"9ElEoLMZ93PS8lm6QI0wgg",
                "stars":1,
                "text":"I only gave 1 star because it makes you in order to leave a review. This location is slow and the customer service is terrible. They charged me for the wrong drink which was more money than my actual drink I wanted and then the female Barista decided it was ok to give me attitude about it and didn't refund me the difference. Buy Folgers instant coffee and make it at home out of your toilet before you waste your money on this location. Very disappointing service for Starbucks.",
                "useful":1,
                "user_id":"7VhHZCAX6QoLgQYmxlHPkw"
            },
            {
                "cool":3,
                "date":"2017-03-17 23:00:49",
                "funny":0,
                "review_id":"e3gw6cSNjfbsvcjFD_9_tQ",
                "stars":5,
                "text":"Awesome baristas, great parking and my drink tasted great!",
                "useful":0,
                "user_id":"U5vnrSTvaoFLdaFoe5r1Yg"
            },
            {
                "cool":0,
                "date":"2016-01-07 02:11:10",
                "funny":4,
                "review_id":"rubetdJtF9c_M0H4qDX8oQ",
                "stars":1,
                "text":"HI LOLA !\n\nUr customer service sucks! U need to learn how to talk to ur customers before working at a customer service field ^^\n\nI came in here to order three travelers but went through the drive thru and they said we have to order that inside so we came inside to order them. Then LOLA looks at me and said \"u think u can order that through drive thru?! U have to come into order them\" ok i didnt know so i ordered the travelers (3 of them) and asked how long would it take and she goes \"WELL WE HAVE TO BREW THE COFFEE\" like i know how long it takes to brew three travelers. So i asked her so how long would it take and she looks at me like I AM DUMB and say \"abt 15 mins\" i dont want attitude from u... If u dont like ur job... Please just quit... And do us a favor and not make other ppl feel like shit...\n\nTHANK U ! But please learn how to talk to customers. And dont think that ppl know what u know... I hope i dont see u when i come back here ^^\n\nBy the way beautiful and clean starbucks ... Its just LOLA.",
                "useful":0,
                "user_id":"nKSvzpj6TXUcp_3Kzm1GRg"
            },
            {
                "cool":0,
                "date":"2014-07-01 00:18:29",
                "funny":0,
                "review_id":"YJflzKhp6ac74q7CgZMUEw",
                "stars":5,
                "text":"As a barista at this store I won't leave my biased review :P however, I just wanted to say that the staff will be relieved when I tell them that this is why people take pictures of us sometimes. It was beginning to creep us out a little, hahaha. Also, if we ever had Ethiopia Yirgacheffe for the clover brewer again you REALLY REALLY need to try it!",
                "useful":0,
                "user_id":"1YxH8Wh3yFEebaCTjJwVZg"
            },
            {
                "cool":1,
                "date":"2018-02-25 22:32:28",
                "funny":2,
                "review_id":"L3qS-f5mY1SSTCpAYMqCBw",
                "stars":4,
                "text":"Disclaimer: I can really only speak to the drive-thru, weekday, AM crew. All of my visits to this location have been between 7am and 8:30am. \n\nTo be honest, I try to take advantage of the coffee we have at work. My thought behind this is that if I can save money that would otherwise be spent on Starbucks, I can use that on ordering all the things at a new place on my \"need to try sometime\" list. But, on the occasional \"eff it Friday,\" this is my go-to location for a few reasons:\n\n1. Proximity. It's on the way to work. Enough said there. \n2. Drive thru. It's early. I'm lazy. Sue me.\n3. Service. The woman who usually works the drive-thru window is so bright and cheery that it's contagious. I'd even dare to say that I end up not needing the caffeine boost from the venti pike roast that I usually order. \n4. Speed. I usually arrive before the line is so horrendously long that you decide to walk in and save some time. However, on the few occasions where the drive-thru line snaked beyond the allotted path, the wait was always far shorter than I would imagine. \n5. Ability to redeem rewards. I work on the strip. I usually take in an afternoon treat at the Starbucks nearest to me, but the problem is that location can't take rewards. It's annoying. It's lame. I can't change it. Thankfully, this location gives me a chance to prevent that hard earned overly priced reward from going to waste. \n\nGood, solid, spot.",
                "useful":4,
                "user_id":"5DFshFQlbQiQTvtzH7qwlA"
            },
            {
                "cool":2,
                "date":"2016-04-25 15:55:13",
                "funny":1,
                "review_id":"LL4M7etOGDbhE6YjzuXtkA",
                "stars":5,
                "text":"Open until midnight.. Probably only a few of these in Las Vegas! We had ordered a Caramel  Frapp with extra whip cream and extra caramel. And it was just the way my wife wanted. Very polite barista. Did not wait long. I recommend coming to this one if you want Starbucks late and like the extra toppings on your drinks.",
                "useful":1,
                "user_id":"HNih-GlBsqSvVUIdPlUO9Q"
            },
            {
                "cool":0,
                "date":"2016-08-16 16:03:43",
                "funny":0,
                "review_id":"340WprtfQs43kIG_1KTeRw",
                "stars":1,
                "text":"Waited in the drive through for 35 minutes this morning. It only fits about 8-10 cars. So that's not okay. One car spent nearly 10 minutes at the window. No hello when I got to the window and no sorry for the crazy wait.\n\nAnd on top of that, prices are higher here.",
                "useful":0,
                "user_id":"ZjVS2eUMglYnBfUu-pNXAw"
            },
            {
                "cool":0,
                "date":"2015-04-20 18:56:01",
                "funny":0,
                "review_id":"tn5iR3am0BZjO9LaS8HFPA",
                "stars":2,
                "text":"I guess if you like their coffee this place is for you. This location is perfect for me since it is on the way to work, but I really don't like much of anything they serve. \nSpicy root beer? no, nothing special and it was off the menu the last time I went through the drive thru. Breafast food items are boring and tasteless. \nI tried a berry lemonade thing the last time and it was just expensive and nothing to rave about. Cup overloaded with ice :-(\nStarbucks has their following, but I don't really like anything from this place.\nGreat location off Flamingo and close to the Las Vegas strip, that is about it for me.",
                "useful":1,
                "user_id":"rn2DB_YX0BvToYe50RNr_Q"
            },
            {
                "cool":0,
                "date":"2016-07-07 21:35:55",
                "funny":0,
                "review_id":"PQIurPQ-db8hyW37UWqrKQ",
                "stars":4,
                "text":"I work very close to this location and cannot beat the convenience of a less then five minute drive to satisfy a 2:30 pm coffee craving. Staff is fast, friendly, and efficient. They even offer a $8 lunch special with sandwich, bottled water, chips, and fruit. Great value! The only downside to this particular location is that the prices are HIGHER than the average Starbucks. Overall the convenience factor I feel is worth it.",
                "useful":1,
                "user_id":"KjMt33U4VCs84CQAEn3XUg"
            },
            {
                "cool":1,
                "date":"2014-10-16 11:35:43",
                "funny":3,
                "review_id":"3dZSC-GkADdtmw5yvS2Pdg",
                "stars":5,
                "text":"By far the best Starbucks in Las Vegas! Its a drive through and a Coffee shop, Loved the inside and the retro design and the industrial stools, the staff are really friendly and they know how to serve well, the line is always busy but its goes down real quick! they have an endless menu of different coffees and cold drinks and cakes and pastries, The prices are much cheaper than the rip off Starbucks on the Strip! We drove from the Aria resort to this Starbucks every morning, we loved it that much! \n\nThe WIFI also works great! \n\nits great to just sit enjoy the coffee and people watch, you can even see the planes coming into land at Mccarran Airport! \n\nJust wish the Starbucks in the UK were like this one!",
                "useful":1,
                "user_id":"-3paZwdNXO4zRa55ZQtNkQ"
            },
            {
                "cool":0,
                "date":"2014-06-19 01:32:55",
                "funny":0,
                "review_id":"0raVsy14TE4yUEcaqSjLJw",
                "stars":3,
                "text":"Not sure what other reviewers mean by comfortable seating. Compared to older Starbucks, the seating in here stinks. There are plenty of army type metal chairs and stools, and only three armless, stiff upholstered chairs clustered around a teeny tiny table. Very ultra industrial, with a very, very high ceiling so noise echoes like crazy. Also, the new \"boulangerie\" pastries are pathetic. Everything is tiny and sad looking. But the good news is, for old timer Starbucks customers like me, I can still get a decent cappuccino.",
                "useful":1,
                "user_id":"xmmTvdEBX53B1Fo_B28MNw"
            },
            {
                "cool":0,
                "date":"2017-05-28 22:31:19",
                "funny":0,
                "review_id":"xekIpwckhfFLrPC1Y1z0kg",
                "stars":1,
                "text":"Came here late night around 10pm due to having a long drive coming. To be honest the person taking orders had trouble knowing the menu well which wasn't too big of a deal to me at first. But when my order of a caramel macchiato came out there was no caramel flavoring and was simply just plain iced coffee. After the drinks were handed over to us the straws were also forgotten.",
                "useful":1,
                "user_id":"StDXvY8qiGoobrdvNfbCmA"
            },
            {
                "cool":0,
                "date":"2015-01-08 20:32:18",
                "funny":0,
                "review_id":"C-7vd_KQDxeTratrd0U1Cw",
                "stars":4,
                "text":"Starbucks is Starbucks. Staff is friendly...drive-thru staff can be a bit mechanical...but I cannot blame them.",
                "useful":0,
                "user_id":"AolnyiEB_UMlQtD_dp5E9g"
            },
            {
                "cool":0,
                "date":"2016-05-09 20:16:11",
                "funny":0,
                "review_id":"c-rcTSVE_7dqEZ2NNqAn5A",
                "stars":5,
                "text":"Sharon by far is the most fantastic person there! She has excellent customer service! Lindsay is also a rock star, they are fast and never get my order wrong. I only wish the Starbucks by my house was this good!!!",
                "useful":0,
                "user_id":"I2anZNa50bUSBGSOeL93XQ"
            },
            {
                "cool":0,
                "date":"2015-02-07 20:23:57",
                "funny":0,
                "review_id":"HWtJZDUVmMSYU1aSlO9R1A",
                "stars":5,
                "text":"I absolutely love this Starbucks! It's the most beautiful one in Las Vegas. The customer service is always up to par and I have never had a failed drink here. This is my go to Starbucks for studying, meeting up with friends, or spending some time alone. Totally incredible people and interior! I will be back :)",
                "useful":0,
                "user_id":"c2MQ_LPuvtiiKFR_-OY9pg"
            },
            {
                "cool":0,
                "date":"2018-06-11 20:36:27",
                "funny":0,
                "review_id":"sQRiaG9PdBc8k6CFgHTYZA",
                "stars":4,
                "text":"Brandon is the only one there who understands EXTRA CARAMEL???? Simple... the only time i get it is when hes there.... theyre very good about having it ready snd I seldom wait... taking that into consideration, I gave 4. If I could get my caramel and ONLY 2 scoops of chips, it would be perfect!!!!",
                "useful":0,
                "user_id":"EA-UgJmd-hQ8RBn1odmDJg"
            },
            {
                "cool":0,
                "date":"2015-09-27 18:17:21",
                "funny":0,
                "review_id":"8939-SkSGEf3_ueUUB7W9w",
                "stars":1,
                "text":"We've been waiting for coffee like 20mins. The workers are slowly and new. Not like Starbucks",
                "useful":0,
                "user_id":"-exBZ_Oq2h24lghHh61JEA"
            },
            {
                "cool":0,
                "date":"2017-11-23 21:09:29",
                "funny":0,
                "review_id":"Sa9oiZ58mmzV6hHiizu4Yw",
                "stars":1,
                "text":"Damn!  Super expensive almost double prices. I asked the guy why it is so expensive he replied very rudely. 'Because we are close to strip'.",
                "useful":0,
                "user_id":"zETu83CtWcMBZ3awvBd-ww"
            },
            {
                "cool":0,
                "date":"2014-10-03 08:16:26",
                "funny":1,
                "review_id":"wjR2SPyFDgS-M6WXyDsbBw",
                "stars":5,
                "text":"Nice store, and the staff always does a GREAT job.  Excellent move on the relocation from the old store next to FedEx Kinkos.  \n\nOnly complain is I wish they had bathrooms that could be accessed by multiple people, as it seems like someone is ALWAYS in the bathroom at this place when you need to use one.",
                "useful":1,
                "user_id":"-8APNXHR8Zk3Pm43d1M4QQ"
            },
            {
                "cool":0,
                "date":"2016-10-03 19:17:42",
                "funny":1,
                "review_id":"rdjzXzG74jzKontsgALE3A",
                "stars":5,
                "text":"I LOVE this Starbucks! Michele was very kind and smiled the entire time she was talking to me at the register! I loved my drink and will be back very soon!!",
                "useful":0,
                "user_id":"KH3Org6LXUpI9pWCQ6kX4w"
            },
            {
                "cool":1,
                "date":"2017-12-21 00:02:59",
                "funny":1,
                "review_id":"GjVN1J_u8alU1xddQh86cw",
                "stars":5,
                "text":"Was a bit hesitant about this location given their recent reviews. Nonetheless, my Venti Pumpkin Spice Frappe and Venti Gingerbread Frappe was well made by Landon! Excellent service, lots of indoor and outdoor seating, and of course yummy drinks.",
                "useful":1,
                "user_id":"CpntrjFnW2YWZ0yIPTd2ZA"
            },
            {
                "cool":0,
                "date":"2016-07-08 18:01:38",
                "funny":0,
                "review_id":"wCB0or9hHCgMOxgwaG0ZIQ",
                "stars":1,
                "text":"I would really appreciate a nice staff. An older lady that works every morning in the drive thru window is really rude and a smart ass. They messed up my drinks a few times and when I call to complain in the nicest way ever, they are rude as hell. Service sucks 80% of the time.",
                "useful":1,
                "user_id":"whq8yA_0x7wYKS8breMoZw"
            },
            {
                "cool":0,
                "date":"2015-03-23 13:12:47",
                "funny":0,
                "review_id":"_QDqWYhysjzwXRCstoDLkg",
                "stars":2,
                "text":"This location is notorious for having way to many homeless people with all their baggage and belongings. This is the type of stuff that has been fished out of dumpsters and now creating a health hazard as well as a fire hazard by blocking walkway. I witnessed a homeless person with 4 bags and suitcase sleeping in the store and I asked the employee to wake her up and ask her to  leave. The employees response was, she's a paying customer too. I then stated the health issues she was causing and the employee did nothing to remove this person. Totally disgusting and I hope Mr. Schultz does something to address this issue.",
                "useful":0,
                "user_id":"C6GA6IHglhhDSEsYstQR0A"
            },
            {
                "cool":0,
                "date":"2017-03-07 21:19:52",
                "funny":0,
                "review_id":"M9-aQOITns-WwZyNL1xwrQ",
                "stars":2,
                "text":"I come here often for the convenience it allows me to be in the vicinity of LVBD. What I've noticed is that this place has become a Hobo hangout. I feel slightly awkward in leaving personal items behind when going to the restroom. The restrooms have been becoming increasingly dirty to the point that they put key-code locks on the bathrooms (I'm assuming to curtail their homeless-persons issue). You will find yourself competing for seats with the hobos. I'm sure they are trying to fix the issue or at least I hope they are. Otherwise, the service is great. The location is ideal and the building is relatively new.",
                "useful":0,
                "user_id":"JjarhVHb3O74q6Cle2_EuQ"
            },
            {
                "cool":0,
                "date":"2017-02-25 13:52:25",
                "funny":0,
                "review_id":"W9IlmDi4DdVF8TP-K3_Ztw",
                "stars":4,
                "text":"For all the bad reviews I had a good experience.  I was Driving thru and had to get a hotel in Vegas just to sleep before driving on.  Hotel was a dump so wanted to leave soon as I woke at 5am. No line at this Starbucks and the employees were super friendly.  Price for my drink was only 75 cents more than LA - not too awful.  Barista made my drink perfect!! And it was custom. \nNo 5th star only because the Manhattan Beach Starbucks at pier will always be best in world hah.",
                "useful":0,
                "user_id":"d7pgp3_CMGvrlzsQ0BFcdQ"
            },
            {
                "cool":0,
                "date":"2018-04-18 15:16:22",
                "funny":0,
                "review_id":"8yfktrGL8x_1IaDHj1at2Q",
                "stars":4,
                "text":"A pretty busy spot but a great neighborhood location to pick up some fresh coffee in the morning.",
                "useful":0,
                "user_id":"5BpOyawXDHN1_YKd4i9QbQ"
            },
            {
                "cool":0,
                "date":"2014-12-07 20:45:01",
                "funny":0,
                "review_id":"Nvys5NPyWIjal9RKoUA2Yg",
                "stars":2,
                "text":"They screwed up my drink twice and finally made it right the 3rd time. I'm talking major screwup, like a grande latte instead of the ice Venti Vanilla latte I ordered. Oh and it took 20 minutes from when I pulled into the drive through til actually leaving the window. I could see people getting upset in their cars. I hope it's not always like this.",
                "useful":2,
                "user_id":"f5AzyVdIDASkl8kAJSZq7Q"
            },
            {
                "cool":0,
                "date":"2016-08-17 20:40:47",
                "funny":2,
                "review_id":"tLnJvo3uK977VKyhEdI2OQ",
                "stars":2,
                "text":"Just stopped by this location for an iced beverage. Paid order with a gift card and had a balance owing of $1.50 towards the purchase. I pulled out my debit card and was asked to produce ID.  R u kidding me?  You're worried about a $1.50 charge from a local being fraudulent but you'll gladly remake a $6 drink if it's not right?  Demeaning and uncalled for.  No thanks I'll go back to the suburban locations for my coffee fix",
                "useful":0,
                "user_id":"7fg1fuiUxFeWXWhuVo_PpA"
            },
            {
                "cool":0,
                "date":"2017-04-23 14:24:18",
                "funny":0,
                "review_id":"WPE3yY21AV3BClMpgVZK_Q",
                "stars":5,
                "text":"We stopped in before heading out on our Saturday night and the staff was super friendly and our order was ready very quickly. No complaints!",
                "useful":0,
                "user_id":"dZjO7sHqtLG_QdSUImOyjQ"
            },
            {
                "cool":0,
                "date":"2016-08-31 20:55:28",
                "funny":0,
                "review_id":"_ewGiyLTAkjA5kWaJfLKhQ",
                "stars":4,
                "text":"I come here at least twice a week, either for myself personally or for my office. It is always a pleasant experience. The drive through service is always quick and efficient even during peak hours!",
                "useful":0,
                "user_id":"_49YvRKEHGE8KJ7fHDfiNA"
            },
            {
                "cool":0,
                "date":"2015-07-09 17:04:39",
                "funny":0,
                "review_id":"akN7wQzl20aFXCm_c2iMhw",
                "stars":5,
                "text":"Wow! Great experience! Went in for breakfast, iced tea, and iced coffee before daughters dance competition. Cashier was genuinely nice. Not over the top but just a genuine person. They called us up for our breakfast sandwich and she had labeled our order \"tiny dancer\". We were feeling so tired from the night before and this was such a great pick me up for the morning! Thank you Starbucks team for making our day and kicking us off with a small act of cuteness that had a big impact to our morning! Oh, and the drinks were great too. :)",
                "useful":0,
                "user_id":"3-LG78W00O6f6isG0ijClQ"
            },
            {
                "cool":0,
                "date":"2018-07-29 20:58:45",
                "funny":0,
                "review_id":"NzzvGsoH6DzS5-A8bBJgwQ",
                "stars":1,
                "text":"Worst cup of coffee ive ever gotten at any establishment. They also got our order wrong. My girlfriend did love her Strawberry whatever it was, but mine was just... no flavor, not what I ordered, and overall disappointing. I'm sure that maybe someone was new, or it was on off-day, or SOMETHING. Anyway, not worth what I payed for.",
                "useful":0,
                "user_id":"sfRZj4CH4dU4YT42pvNFJw"
            },
            {
                "cool":0,
                "date":"2018-07-31 16:42:53",
                "funny":0,
                "review_id":"NKeDpk7_alZUDEK29vqf4g",
                "stars":3,
                "text":"Love you guys but when you spend $5.35 plus tip for these delicious egg bits and they are undercooked with consistency of hot jello, kinda feel ripped off",
                "useful":0,
                "user_id":"F9FxxG9BSrIh8Ii_qjFvtA"
            },
            {
                "cool":0,
                "date":"2017-03-08 22:58:31",
                "funny":0,
                "review_id":"tGyg_v8_XyBNoqx7WPBBVA",
                "stars":1,
                "text":"Worst Starbucks in town. Having to work in the same plaza and having this as the only option is frustrating. Having worked in this area for years the turnover is ridiculous every week it's a different person taking your order. This wouldn't be an issue if they didn't get he orders wrong 50% of the time. When you ask to have the order corrected the staff looks at you like it's your fault. Not to mention that this location somehow gets to charge Strip prices while being blocks and blocks away from the strip.",
                "useful":0,
                "user_id":"yCnrXvviTl-_Gcf88YmNtg"
            },
            {
                "cool":1,
                "date":"2014-01-26 03:34:43",
                "funny":1,
                "review_id":"FoW86s21TpDgcwrGhUAONQ",
                "stars":3,
                "text":"This Starbucks is a very cute location, but I was surprised at how little seating is available compared to how big the building appears. I got a grande mocha Frap, which was as good as any mocha Frap I could get at other locations.",
                "useful":1,
                "user_id":"zI0cogkqx4WQArqzTHXd-Q"
            },
            {
                "cool":0,
                "date":"2016-05-13 20:40:40",
                "funny":0,
                "review_id":"yV661wxcRssGM8lVZl8YHQ",
                "stars":4,
                "text":"I work in the offices near this Starbucks. It's a convenient location and has a drive-through, which I love. They also now offer the Starbucks pick up where you can order your drink via their mobile app then go in and pick it up. I recommend doing this because the drive-thru here can get really crazy. Especially during peak hours. When the line is really long for the drive-thru I usually just go inside and order because the drink gets made a lot faster. When the place is busy they also run out of parking spaces so you have to park on the dirt to the left of the building.\nThe only reason why I don't give them 5 stars is because the prices at this location are ridiculous. They charge more because they are so close to the strip and they get a lot of tourists, but still, I shouldn't have to pay over $5 for a venti iced tea. At any other Starbucks location my tea is usually around $3.75. This location has raised their prices around two or three times in the past 2 years. I used to come here more often but now I just can't bring myself to spend $5 on a drink.",
                "useful":1,
                "user_id":"lHFkt91UFwQUywggO8yDHA"
            },
            {
                "cool":1,
                "date":"2014-03-07 18:44:26",
                "funny":1,
                "review_id":"7RgYMvkVai3GiCcCucAgHA",
                "stars":5,
                "text":"I always go through the drive thru and they are so efficient and always so warm and friendly early in the morning. Love the new building and little drive thru. They are sooo efficient and have the process down like clockwork.",
                "useful":1,
                "user_id":"LubOvS08WwKTWugQ2V9_1Q"
            },
            {
                "cool":0,
                "date":"2017-09-04 21:00:27",
                "funny":0,
                "review_id":"TvDfygDdh7xhCjgd6GQ2sA",
                "stars":1,
                "text":"never go to this starbucks there was a cockroach in my coffee this morning, it was very disgusting so i came back and they did not even give me an explanation",
                "useful":0,
                "user_id":"vx8yHeaKnfXF_3UzBgqRjA"
            },
            {
                "cool":0,
                "date":"2017-09-14 23:22:31",
                "funny":0,
                "review_id":"uceasA3kz88M1VMXOmIsvQ",
                "stars":1,
                "text":"Prices here are 22% higher ( for my 3 espresso shots ) then anywhere in town just because it's close to strip ( 0.9 miles to be exact ) It's not good enough reason to keep prices higher.",
                "useful":0,
                "user_id":"4_rFGheun09YKJ10_NxA9g"
            },
            {
                "cool":0,
                "date":"2014-03-07 18:13:15",
                "funny":0,
                "review_id":"megi76wLMX5Ve4h2ROHWWw",
                "stars":5,
                "text":"Great location. Modern free-standing location with great service, friendly people, comfy seating & good parking.",
                "useful":1,
                "user_id":"UY0s1RR0WZkpzTnmMnpBxg"
            },
            {
                "cool":0,
                "date":"2015-08-27 01:56:21",
                "funny":0,
                "review_id":"eLeDJQ57Dhrlp7b0Mujxag",
                "stars":2,
                "text":"The communication barrier is too great in the drive thru. Our order was all messed up and the communication was a joke.",
                "useful":1,
                "user_id":"WB5zT2HLKVdJw-XrCmUG0A"
            },
            {
                "cool":0,
                "date":"2016-02-08 03:51:59",
                "funny":0,
                "review_id":"lTe4WwDDfWr-iFQ9KWY7fg",
                "stars":5,
                "text":"I've been coming to Starbucks since I could remember. Point is, I love Starbucks, but I've never written a review or comment about any location or barista. \n\nThis location is close to my house by the university and it's my favorite so far. The baristas are so nice and the drinks are always perfect. The inside is also very nice compared to other Starbucks. \n\nI never knew you could order drinks in a real cup and I saw a barista named Chelsea making a flat white and she make a little design on top! It was so cute and I complimented her on it and she made me one! So very nice of her, made my day, and reminds me why I love Starbucks so much! Thank you!",
                "useful":0,
                "user_id":"AJlJ2shHZM0NxCLvW2BGzA"
            },
            {
                "cool":0,
                "date":"2017-03-11 14:51:27",
                "funny":0,
                "review_id":"IAtEoXF5PFCvpForAuZlQQ",
                "stars":1,
                "text":"Cashier doesnt even greet me or with a smile, she got my order wrong and seemed annoyed when i asked for a remake even though i asked nicely and its not even my fault!! This is the last time im going here! Caffee Bottega across the streets is better, i just thought this was convinient cause they have drive-thru but nevermind.",
                "useful":0,
                "user_id":"r7NCkJbvwc9QAp6udyBF-A"
            },
            {
                "cool":2,
                "date":"2014-05-03 19:08:15",
                "funny":0,
                "review_id":"XQIMU9M-oOM7a5Ma8HLIcw",
                "stars":5,
                "text":"This has got to be my fave Starbucks to-date. Love the interior design. It's so spacious, modern and trendy inside. Service is friendly and fast. The drive-thru is convenient! If you're in Vegas, def check this Starbucks out :)",
                "useful":5,
                "user_id":"9TWgmxmhL_y5zF2s9S2TQA"
            },
            {
                "cool":0,
                "date":"2015-09-18 15:41:37",
                "funny":0,
                "review_id":"NBLAa7J0r_c2DW7RM7gW3w",
                "stars":5,
                "text":"This is one of the best Starbucks in Vegas, definitely the best near the Strip. It's modern, efficient, spacious, and they have plenty of parking. Best of all, they have the order online option with the app so one can avoid the lines.",
                "useful":0,
                "user_id":"Y7yuNThJFQFJ1Jgx-T11WA"
            },
            {
                "cool":2,
                "date":"2015-10-04 08:26:33",
                "funny":2,
                "review_id":"WTwzQOYRLorPAM08aMtnsQ",
                "stars":5,
                "text":"This is the largest of the Starbucks in Las Vegas. And probably the best staff of any of the ones I've been in. I've been in some of them that have employees that appear to be just starting out. \nEven after they've been at it a year or two. But not this bunch; they're friendly, efficient, and\nforever smiling(alliteration is my OCD, I shall not want). I've encountered 20 different employees\nsince I started coming here(03/2015) and all of them know their drill, no matter where they're positioned. The crowd is varied, but the overwhelming demographic seems to be cab drivers.\nAll of them courteous, kind, and faithful to the law of the pack. This starbucks also employes\na feature I hadn't seen at any other SB, a printed label affixed to your beverage cup that gives \ncustomers first name, volume of drink, and description of drink(quad expresso, decaf, ice). They've all but eliminated the infrequent but nonetheless, annoying peccadillo of giving your \ndrink away to someone who doesn't speak inglesi. Perdoname, maestro, tiene mi  cafe. Dame\npor favor. Gracias ,Senor. Vaya bien. While you stumble through the best imitation you can muster, your drink is losing its maxissimo poder. Starbucks creativity to the rescue! They have also got a better line of edibles than the others, featuring my favorite a sandwich made with flatbread, which looks like a thick saltine cracker(1/2\")with a choice of vegetable and chicken,\nor full on veggie innards. Todo es groovy al esta lugar. 24/7, 430AM- Media Noche. Stop in.\nit will make your day.",
                "useful":2,
                "user_id":"PNiDVKKlaUmElNvQkUy6Qg"
            },
            {
                "cool":7,
                "date":"2014-03-10 05:12:55",
                "funny":3,
                "review_id":"HtYVhyY7jGxG054PX4trKw",
                "stars":5,
                "text":"I go to Starbucks every day.  This was my first time at this new location on East Flamingo in the Howard Hughes Center.\n\nThe shop is roomy, it has lots of product (juices, pastries, and sandwiches--typical Starbucks stuff.  The wifi is free and it's fast--faster since Starbucks converted from AT&T to Google for their wifi.  There are two areas to sit outside.  There are some tables along the front and there's a patio on the east side.  Since the building is quite tall, it gives you shade in the afternoon.\n\nThere are plenty of chairs and one long table with stools where you can work with a laptop or just use your smartphone.  It's far enough away from UNLV that students won't walk here to hang, study, and otherwise be their normal pains in the butt as they are across Maryland Parkway from that Bucky.  This will just be a place where the adults come to use Bucky's wifi so they can conduct their businesses from their \"office.\"\n\nThe staff was on the ball today and it was a good stop.  I'll be back again now that I know the store is open.",
                "useful":4,
                "user_id":"PKEzKWv_FktMm2mGPjwd0Q"
            },
            {
                "cool":0,
                "date":"2016-06-29 15:18:13",
                "funny":0,
                "review_id":"t8bnfzXZcXU7JkZJDh6Fqw",
                "stars":5,
                "text":"I had a most pleasant experience at this 'bucks location.  The service was excellent. Props to Albie, my cashier, for being fun and super friendly. I loved the decor. Made me want to hang out here more often.",
                "useful":0,
                "user_id":"M88k2har3onQiS2H86DKPg"
            },
            {
                "cool":0,
                "date":"2015-08-18 12:15:30",
                "funny":0,
                "review_id":"yYK92IWrXb2oRvMhX5K8bQ",
                "stars":3,
                "text":"I'm a Gold member 10 times over.  This location was designed very poorly.  It was exciting seeing this new location being built as this is a very busy store.  Even though it's the most convenient to my work, I only go to this location when I have no time to stop at another beforehand.  With the time and planning involved, this store should have been the flagship to them all.  The inside feels claustrophobic.  There's nothing comfortable about it.  Someone is always standing in front of you.  Parking is a joke.  Staff is off and on mainly cause this store is insanely crowded.",
                "useful":0,
                "user_id":"-HfAVM2M8H4XtKLdQRgHlA"
            },
            {
                "cool":7,
                "date":"2014-01-28 14:51:25",
                "funny":5,
                "review_id":"ZFx3C687wc8E8MuBJR5LPA",
                "stars":4,
                "text":"Only 4 weeks old and a brand new building including a drive through. This is one of the largest Starbucks I've visited. What a difference compared to the original location in Seattle which opened in 1971\n\nThe driveways from Howard Hughes weren't paved yet it's so new. The service was solid and selection of coffee and brew paraphernalia was impressive. \n\nThis will be a regular stop when I'm in town!",
                "useful":10,
                "user_id":"o4tYl3Hz0oDfpNn4k02DCw"
            },
            {
                "cool":0,
                "date":"2016-05-02 20:08:03",
                "funny":0,
                "review_id":"0QXn_rntt9QE1FVBNBr2cA",
                "stars":4,
                "text":"Der Starbucks ist etwas größer mit vielen Sitzgelegenheiten. Das Ambiente ist mal anders, als in den üblichen Starbucksläden.\nDie Bedienung ist schnell und sehr freundlich.",
                "useful":0,
                "user_id":"8XDH2lsPhv0wlLeRoWpTuA"
            },
            {
                "cool":0,
                "date":"2015-03-26 17:29:06",
                "funny":1,
                "review_id":"_qDNzSwnBPaBbbO5JIgnmg",
                "stars":1,
                "text":"What kind of a Starbucks does not put stoppers into their coffee??!! As this lady (who gave me whip cream when I said no whip cream) gave my husband his BLACK HOT COFFEE it spilled over his white Armani shirt. They're lucky we were able to get it out or I would've demanded they pay for it. Should not have older people who can't hear working the drive through or anywhere in the high pressure service jobs. The little details matter and this one could've been costly.",
                "useful":0,
                "user_id":"yvf1-d6OJsD1BT_K3QoKAA"
            },
            {
                "cool":2,
                "date":"2013-12-24 03:49:21",
                "funny":0,
                "review_id":"vIUUrv-o_Lf80vTbpwX42Q",
                "stars":5,
                "text":"This one replaced the location on Howard Hughes (inside FedEx). It is very bright from the floor to ceiling windows. The lobby is spacious and there are plenty of tables. This location has a drive thru and features the new Clover coffee brew machine. The Clover is a specialty machine that brews Starbucks reserve and exotic coffees by the cup. The price of the Clover brewed coffee is a little higher but the coffee is of a higher quality.  Although I'll miss the old location on Howard Hughes from YEARS of being a customer, this one is much nicer.",
                "useful":3,
                "user_id":"3Kn4WUjRW4mktpYa0El3IQ"
            },
            {
                "cool":0,
                "date":"2016-03-04 20:37:31",
                "funny":0,
                "review_id":"KMjwy10AuuduvmaVzt3uGA",
                "stars":2,
                "text":"The employees at this location are great. The district manager should be chastised however. She raised the prices to match \"Strip pricing\". This Starbucks is often filled with taxi and limo drivers. I am a limo driver. Way to stick it to the working people who are the core of your business. I hope your numbers look good on paper because your store reputation is bound to suffer. I'm not coming back.",
                "useful":1,
                "user_id":"-57uOzAWlx__p6QlX1pojA"
            },
            {
                "cool":2,
                "date":"2014-03-09 22:10:24",
                "funny":0,
                "review_id":"6pe3P_yyijiZSTVDCCtXvA",
                "stars":5,
                "text":"This is my favorite Starbucks.   It is a standalone building and it is quite modern.  Yes, the drive thru can be a bit hectic but that is because of its prime location, right off Flamingo.  That is not only great for the Starbucks believers but for the business itself.   Sharon typically works during the AM hours and it is amazing how one person along with a great cup of 'whatever you order' can enhance your day.  She is always pleasant and so friendly.",
                "useful":0,
                "user_id":"xCqqBsp0w0sz6bJWqsCxAg"
            },
            {
                "cool":6,
                "date":"2015-01-29 01:49:02",
                "funny":5,
                "review_id":"OdhtsudtkAPAH3LvEhCkqA",
                "stars":5,
                "text":"This update is long overdue. I've been visiting this location when I visit Las Vegas  for business or pleasure which is at least once a month. Parking is usually not bad but during peak hours it can fill up and you may have to park west in an unpaved lot.\n\nI usually arrive in the am and the staff here is what make this location so unique and special. Daily customers which I've met two - get their coffee brought to them in regular coffee cups! The staff knows their clients so well they are preparing their orders before they reach the counter. This location also offers the Starbucks Reserve products and has a clover machine for preparation of one cup of reserve at a time.\n\nThis Starbucks is one of my favorite locations and  Thank you to the entire staff for the outstanding service & quality!",
                "useful":7,
                "user_id":"o4tYl3Hz0oDfpNn4k02DCw"
            },
            {
                "cool":0,
                "date":"2014-10-24 15:53:36",
                "funny":0,
                "review_id":"P15sgKC6y7e9KJja1B8qQg",
                "stars":5,
                "text":"Great coffee! Wakes me up each and every day. Cannot wait to get my mojo there in the morning. Some days it seems stronger than others but I love it.",
                "useful":0,
                "user_id":"_A5vHoFRXBcmBertTQgoRg"
            },
            {
                "cool":0,
                "date":"2016-11-06 17:08:37",
                "funny":0,
                "review_id":"qsVPDbPEbn6Jix5svEVTwA",
                "stars":5,
                "text":"A great store. Shout out to Lauren for being an excellent manager, although a more appropriate term for her would be \"leader\". Brandon, a shift supervisor who works like there's no tomorrow, and is one of the friendliest people working at this location, and to John Joshua, affectionately called JJ. I've been there for a few months and saw excellent improvement in his skills as a barista, no change with customer service (he already had it!). Congrats on partner of the quarter (as of fall 2016)! Huge thank you to this",
                "useful":0,
                "user_id":"D6J-UXe7xrPPMIT2ipw8Wg"
            },
            {
                "cool":0,
                "date":"2015-07-13 17:24:13",
                "funny":0,
                "review_id":"Q_GKyfPVdgPnVNdnECL93w",
                "stars":5,
                "text":"Love this Starbucks. Always consistent and friendly service. Vibrant atmosphere. Sometimes long lines but they have the staff to move em along quickly. Drinks from Baristas can be quite slow.",
                "useful":0,
                "user_id":"6wWhkHhLMTdnYMPlXRcN9g"
            },
            {
                "cool":5,
                "date":"2018-02-10 00:17:07",
                "funny":3,
                "review_id":"qier4I1t0iKbQXZpAb8bnQ",
                "stars":1,
                "text":"The worst customer service ever !!! Worst Starbucks location all over the nation. The cashier people won't even smile at you ant treat you like they are making you a favor, I let the manager know of how rude they were just to find out that she was even more rude and stupid. \n\nYou incompetent manager girl with purple hair for sure do not represent the company and sooner or later you will find yourself jobless because someone as unprofessional as you are shouldn't be working at this location.\n\nI really hope for someone to read this review and do something about it. \n\nMeanwhile I do not recommend this location to anyone and recommend you to avoid it. On top of it the location looks nasty so if you don't want to catch a virus don't visit this location there's so many other ones with great customer service!!!",
                "useful":9,
                "user_id":"5rXm9JMg9kNYpPdqWbxZpg"
            },
            {
                "cool":2,
                "date":"2015-08-05 07:29:33",
                "funny":2,
                "review_id":"uF8zjM2tf5FYw_WoYty4wQ",
                "stars":5,
                "text":"Can you ever give a Starbucks location less than 5 stars? Though there is just about one Starbucks for every hotel on the LV Strip, this is one of my favorite stations because it is conveniently located near Tuscany (cheap steak and eggs) and the 76 gas station (with super cheap prices too!)\n\nWith the new mobile order it is super easy and convenient for me to create my order while I'm pumping gas or driving down to the Starbucks. If you're not tech-savvy then there's also a drive thru as well. Don't let this store fool you though--it is almost always packed!",
                "useful":2,
                "user_id":"HQnfONrTQKBdHPV7iebtxQ"
            },
            {
                "cool":0,
                "date":"2016-02-19 19:06:45",
                "funny":0,
                "review_id":"fiJ_ChoNGPFF2jU7TTn-Dw",
                "stars":2,
                "text":"I am a local and work on Howard Hughes Parkway.\nI used to love going to this location on my lunch.  Although if it's crowded, it can feel like you are crammed in there, especially during the lunch rush.\nHowever, I went about 2 weeks ago since the weather was nice and I decided to go for a stroll.  I get my Venti Iced Coffee w vanilla and cream.  Typically at any other location besides a the casinos...$3.19.  Here....almost $4.  WTH?!?!?!?!\nI get you are close to the strip however more locals than non locals visit this establishment.  Sooo wrong and you don't have to worry about me returning to this location unless I have a free drink smh.",
                "useful":2,
                "user_id":"xPSXDnjJ_oXoVSlkvmDItA"
            },
            {
                "cool":1,
                "date":"2017-10-23 03:43:56",
                "funny":0,
                "review_id":"trjY90hhtdHZbmkicTBEuQ",
                "stars":1,
                "text":"I love Starbucks and have gone to numerous locations all over the US, esp in NV and CA but I must agree with other yelpers that this locations' customer service and food is mediocre \n\nMy drink order was not as I requested and it came out watery. I ordered a decaf white chocolate mocha frapp with an extra pump of white chocolate mocha. It lacked flavor and I couldn't taste the white mocha. Perhaps they were skimping in ingredients to save money but why? The cost of the drink covers the cost of ingredients!? \n\nUnfortunately my lemon loaf was dry and I was unable to finish it. I thought Starbucks had fresh pastries...that wasn't fresh. \n\nThe Starbucks on the strip cost a lot more but I've never had these problems. Please please please address these issues Starbucks. Thanks.",
                "useful":1,
                "user_id":"Rpw8mQPKJb8esVjosT4Sog"
            },
            {
                "cool":0,
                "date":"2015-06-07 00:50:20",
                "funny":0,
                "review_id":"rwYGaSTNb5MietXJFJtd5A",
                "stars":4,
                "text":"I recently started a new job in this area and like to stop at this location for my coffee fix. With all the other business men and women and visitors from nearby, it can get pretty busy and crowded. The longest I ever had to wait for my order was 13 minutes (it was a pour over, so it is excusable). It all depends on the time of day, i.e. business crowds who are starting work or on lunch break. The staff is friendly and welcoming. I enjoy coming here as it is clean and inviting.",
                "useful":0,
                "user_id":"ka8Pk_MXUXNmPy9kPaO43w"
            },
            {
                "cool":7,
                "date":"2015-03-26 18:19:28",
                "funny":8,
                "review_id":"UTjTqROgkHsAyMn7R_H3UA",
                "stars":4,
                "text":"I know, I know. A review about Starbucks with over a gazillion locations, but I felt the need to call-out one of the good ones. Because we all know Starbuck shops are like Vampires, some sparkle & shine and others just suck the life out of you. \n\nI almost never write reviews about large chains, but this Starbucks has to be the best looking location in Vegas. High ceilings, plenty of room to work, and two, count em', two patios. One in the front and one on the side, both nonsmoking! \n\nThis location also boasts a very fast drive-thru and a hard working crew. When I got here the line was long, which almost caused me to leave, but I noticed how fast it was moving, so I decided to give it a chance. Two minutes later, I'm placing my order and setting up my laptop, and what felt like one minute after that, my drink order is being called out to the caffeine addicted crowd.\n\nMy one and only complaint is, stronger Wi-Fi. As the place began to fill up, the signal seemed to get slower and did cause a little hiccup in my work time.\n\n#FirstWorldProblems.",
                "useful":6,
                "user_id":"i_DR3vdE73nVm2GlMbGpGA"
            },
            {
                "cool":0,
                "date":"2015-10-05 19:57:48",
                "funny":0,
                "review_id":"HpNJSyI3QVlpydDd1dSWLQ",
                "stars":5,
                "text":"In a rainy day like today I feel like I'm in Seattle not Vegas. Location close to the strip without the strip traffic, this brand new building puts out a cool suburban vibe. Tried a skinny Carmel macchiato for the first time and I'm sold! Found my new fave drink for the winter without a whole lotta calories. Meeting my husband here again and again...",
                "useful":0,
                "user_id":"5vNHnhnUWdfGiSnK_QsnwA"
            },
            {
                "cool":0,
                "date":"2016-01-12 22:22:05",
                "funny":0,
                "review_id":"iQEGrva9jvemh1LMsQxqgA",
                "stars":5,
                "text":"I'm a regular at this Starbucks and I always enjoy my green tea latte at this location. When I come here I always look for Albie and Brandon they are amazing!! They make me feel welcome, the drinks are fantastic. They always offer phenomenal  customer service!!! Keep up the great work guys! Ill be seeing you soon!",
                "useful":1,
                "user_id":"3bWF0eTqIM5eXI_0SlCJNg"
            },
            {
                "cool":0,
                "date":"2017-07-06 20:07:53",
                "funny":2,
                "review_id":"gndkkIVXg9ulO-y-lXFPCA",
                "stars":1,
                "text":"To be frank, I love Starbucks.. like who doesn't? Every Starbucks I've been to has been an excellent experience. With great customer service and awesome beverages to top off. But this particular location, I guess they'll have to work on some things. Maybe they missed out on \"customer service\".\n\nI was in a drive-thru, ordering a simple drink. An Iced-Coffee with Soy milk and Vanilla Pumps with EZ ice. A staple. Nothing too complicated there. But it came out wrong and when I asked for it to be remade.. I get an attitude? Huh? Did I miss out on the motto that Starbucks stands for? If the drink isn't up to part, they will offer replacements to meet customer satisfaction? \n\nClearly there was miscommunication but it could've been avoided if their staff were to listen and probably repeat the order and not assume they noted it down? I'm not sure if this particular staff is having a bad day or something but cmon, we (customers) don't have time for your sass. Get your act right because I ended up having a diluted/watered down coffee.. thanks.. \n\nI believe his name tag was Josh?",
                "useful":1,
                "user_id":"cMva3C2QbmmvW1flAwsNVQ"
            },
            {
                "cool":0,
                "date":"2014-02-04 00:57:26",
                "funny":0,
                "review_id":"GHXsRNchiPL43J7YciP1yg",
                "stars":4,
                "text":"Busy place every time I've gone. So many offerings and combinations , it must drive the staff bonkers. They are about as friendly and efficient as they can be though.\nI have to order a \"clover made\" coffee now that SBUX only offers blends, which I don't like at all. Makes me spend more which I don't like either.\nI do like the clover coffees, but I don't like the thought that in order for ME to get what I like, I cannot simply order the regularly brewed coffee ( since it's always blended with coffees I dislike). \nI've been to several SBUX in LV, and this IMHO, had the most outside seats, friendliest staff, and best choices. \nOf all the chain stores in the world ,\nSBUX is the only one I consistently\nseek out. However, their switch to \"blended coffees\"  as well as the consistently weak WiFi (I usually switch to my carrier's LTE) is causing me to re-evaluate my loyalty to SBUX.",
                "useful":1,
                "user_id":"dA7smMo-z6VNmgNzyd640Q"
            },
            {
                "cool":3,
                "date":"2015-12-31 23:47:45",
                "funny":2,
                "review_id":"6gdt14CZY0wjLKkXtyE_-Q",
                "stars":3,
                "text":"Today was my first time at this Starbucks and eh I have experienced better service as well as the quality of drinks. I pulled through the drive thru with no cars ahead wasn't greeted right away. Once I placed my order I had to repeat it twice and then when I got to the window I sat for another 3 minutes until I was acknowledged. Once I was got my drink it was incorrect.. So I'm not sure how hard an iced quad espresso with cream is but the barista forgot my cream and the lady working the window fixed it however when handing it to me had the coffee dripping all over the sides just a mess ugh I guess I'm spoiled or whatever you want to call it but I wasn't impressed to say the least.. It's a nice location though...",
                "useful":2,
                "user_id":"qPVtjjp8sNQ32p9860SR9Q"
            },
            {
                "cool":0,
                "date":"2014-08-07 02:31:32",
                "funny":0,
                "review_id":"cH7TvDKilHDdK4kmDWNFwg",
                "stars":3,
                "text":"I am 100% a Starbucks fan. Almost never does a day go by without me having some product from Starbucks. Today I had a Trenta Iced Coffee and a Pellegrino. The service was fast and pleasant. My drink was prepared perfectly. This location is different from just about every location I've ever been to. It is deceptively roomy with several types of seating areas. My ONE complaint - and it's a big one - is that most of the outside seating area is unusable as it smells of urine. Undoubtedly the small fenced in cement seating area (charming design) has become the sleeping place for homeless people. PLEASE steam clean this area and do something about it. It so weakens this location which would otherwise be one of the nicest I've seen.",
                "useful":2,
                "user_id":"9qeb4Z0BfIJ9Uz62TR2foQ"
            },
            {
                "cool":0,
                "date":"2018-02-07 19:19:06",
                "funny":0,
                "review_id":"0SJ8AZmHuzr6ABJu9j5WOg",
                "stars":5,
                "text":"I have been going to this Starbucks location for the last 4, almost 5 years and I must say their morning crew is absolutely amazing! They are very friendly, welcoming, helpful and make my daily Starbucks run very delightful! My orders are always correct and due to my Starbucks \"addiction\" a lot of the crew knows it by heart now. What can I say I like my daily Starbucks!",
                "useful":0,
                "user_id":"1AmTCSKt05ejbTtrPiqXjw"
            },
            {
                "cool":1,
                "date":"2016-05-15 20:14:46",
                "funny":1,
                "review_id":"nZs9D_Pijn6a7gbvdO-A4g",
                "stars":1,
                "text":"Took 20 minutes in the drive-through just to receive my food they didn't even fill my latte all the way the guy also did not include any napkins with my egg and sausage sandwiches. I go to Starbucks regularly and this is by far the worst Starbucks at ever been to.The egg and sausage sandwich tastes like it is been sitting out for four hours and I just threw it in the microwave.",
                "useful":1,
                "user_id":"RmQSnsotL9fGai71YfVM_Q"
            },
            {
                "cool":1,
                "date":"2014-06-23 21:44:32",
                "funny":1,
                "review_id":"dbygVbbY0rEbgVplHQoMug",
                "stars":3,
                "text":"I think this location is pretty uncomfortable inside. Lots of army style metal chairs, and only 3 armless upholstered chairs clustered around a small table. Also, the new \"boulangerie\" pastries are tiny and unappetizing in appearance. The good news for old timer Starbucks customers like myself, is that I can still get a good cappuccino.",
                "useful":3,
                "user_id":"xmmTvdEBX53B1Fo_B28MNw"
            },
            {
                "cool":6,
                "date":"2016-03-23 22:59:48",
                "funny":5,
                "review_id":"2qaaPt67ucAZNW_RuLeAgQ",
                "stars":4,
                "text":"There's a lot of Starbucks along the Las Vegas strip, but most of them charge two bucks or more then the corporate Starbucks. Some of the locations don't even accept the Starbucks card AND they add the upcharge to their prices.  \n\nStarbucks is already expensive, so it was worth driving 2 minutes away from the Strip to enjoy my London Fog Latte.  Located in the same parking lot as Fogo de Chao and McCormick and Schmidt's, this Starbucks was built about a year ago. It's not a particularly big Starbucks, but there is a communal table and scattered seating and tables inside and outside.  Power outlets are on the floor.\n\nThis place has a drive-through, and they also accept mobile orders. They have all the souvenir mugs and cups too. While the service was good, I thought some of the baristas could be slightly friendlier.  \n\nFor the Californians, remember Nevada charges sales tax for food and beverages... including the refills which are $.055",
                "useful":10,
                "user_id":"cKJ0r01eF7E-tYp2FQOyRA"
            },
            {
                "cool":0,
                "date":"2016-01-04 00:08:15",
                "funny":0,
                "review_id":"QOyWG1RX5R-YfCEj00aWVA",
                "stars":2,
                "text":"Service was fine, staff tried to be helpful, but they didn't have what I wanted.\n\nAlso, I don't like the layout. It feels very cramped with people jammed together into a long, narrow space. The tables and chairs weren't that comfortable. It doesn't have the 'feel' of a place I would want to linger.",
                "useful":0,
                "user_id":"W3Q7UeLJ9FLVoM1sT4W-wQ"
            },
            {
                "cool":0,
                "date":"2017-02-28 06:22:25",
                "funny":0,
                "review_id":"4ycicSFXh-58_ayMAdQc1g",
                "stars":5,
                "text":"Service was good! Atmosphere was pleasant, free wifi and lots of seating! We sat in there for over an hour chatting away, it's pretty small, so Eve's dropping and people watching is all but forced upon you whether you like it or not! \nAlso the bathrooms were clean which is always a nice perk.",
                "useful":2,
                "user_id":"I_6or9vQiL9qoSz5PuW4fg"
            },
            {
                "cool":2,
                "date":"2018-06-11 20:56:48",
                "funny":0,
                "review_id":"As7rDxltQu7vcAxNjmlxDA",
                "stars":5,
                "text":"Starbucks is definitely a place where you know what you are going to get and its process is in place to ensure that you receive exactly what you order and get great customer service. They also have processes in place if you don't get 5 star service. I have been to this location several times in the evenings and my experience has been great.",
                "useful":4,
                "user_id":"Q7IoE5m2heQKThuVq3SYFA"
            },
            {
                "cool":0,
                "date":"2016-03-16 18:04:11",
                "funny":0,
                "review_id":"DlV3E6AzBgG8l9X9St5uMg",
                "stars":5,
                "text":"I have a few of my meetings here at this Starbucks. I like the layout, it's comforting to be around the buzz of other business people having their meetings. Today I had the pleasure of having Josh make my coffee... I forgot to tell him to steam my soy milk for my coffee. When I went back and said \"sorry Josh, I need my coffee to be hotter.. can you steam my soy milk as well?\"\nJosh said \"no problem\" made me a new one! Thanks Josh!",
                "useful":0,
                "user_id":"7XtjpwvWhYd08c6qF-YyAA"
            },
            {
                "cool":23,
                "date":"2015-04-14 01:43:55",
                "funny":17,
                "review_id":"oeVW4nj9K1VFvPgbziWZgw",
                "stars":5,
                "text":"Yes I'm writing a review on the heavy hitter chain that is Starbucks - don't judge. I felt compelled to give a short but sweet shout out to this location because the baristas here are whipping up my favorite drinks exactly the way I like them - strong and not watered down! \n\nI hate being stuck on the strip with the need for caffeine because we don't enjoy spending premium prices for Starbucks. This convenient location \"near\" the strip is our favorite spot. So far, the baristas here can really make our drinks well so keep this spot in mind the next time you are headed to the strip.\n\nThe interior situation is roomier than the previous review made it out to be. There is a long bar in the middle with lots of counter space to post up with your laptop with tall stools to sit in, a few tables and also some comfy seats scattered along the window of the shop. There is also a generous amount of seating outside in the front and side!\n\nBONUS: No shortage of outlet sockets to plug in your electronics. The clean bathrooms are tucked away near an entrance for easy ins-and-outs without making that awkward walk of shame through the whole darn place.",
                "useful":21,
                "user_id":"u_wqt9RshdZsoj8ikLqoEQ"
            },
            {
                "cool":0,
                "date":"2018-01-31 18:50:03",
                "funny":0,
                "review_id":"H7PlMa0gM4GZfcYi7kQPgg",
                "stars":2,
                "text":"Slow service every time I've visited. Not the staff's fault - I don't think they can keep up with the drive-through and the folks inside.",
                "useful":0,
                "user_id":"DD5irerFNGQeu8eM0W3Ylg"
            },
            {
                "cool":0,
                "date":"2018-10-28 22:17:28",
                "funny":0,
                "review_id":"DM0SsynndOW5t67PNmYDuA",
                "stars":1,
                "text":"Is this even a Reserve bar?! The guy behind the counter had no idea what I was talking about.  I thought all Reserve Bars had the ice cream drinks- but the barista looked insanely puzzled. We went out of our way to hit up a Reserve, but be warned- they are not all the same. This place only seemed to advertise the pour-over coffees (although I didn't see the fancy chemistry sets that are used to make it). I think this a fake Reserve.",
                "useful":0,
                "user_id":"PHrJYYJOkQa3KOyLiLCAww"
            },
            {
                "cool":2,
                "date":"2017-11-29 23:53:57",
                "funny":1,
                "review_id":"kuweeYUoHOVoq727kaMJxw",
                "stars":3,
                "text":"I will admit that the service at this location is very good and quick but for some reason our drinks never come out right. I ordered my pumpkin spice frap and it came out really watery and milky. \n\nIt was strange. I've never had issues with any drinks from Starbucks so I just thought it must have been a one-time mistake but after the second remake, it still looked the same. I gave up and tossed my drink.",
                "useful":2,
                "user_id":"V4ufnFKJNV8kEwFMx_5qEw"
            },
            {
                "cool":0,
                "date":"2017-03-03 09:57:40",
                "funny":0,
                "review_id":"GY3FXjD1NxNCllKdkri0og",
                "stars":5,
                "text":"There Customer service was grate.\nThe coffe was grate.\nI will come again for shore.\nFood was fresh..\nBest plays to ...............",
                "useful":0,
                "user_id":"hGUUJtJjh1TkmF3lRorBQA"
            },
            {
                "cool":2,
                "date":"2017-12-12 01:50:36",
                "funny":1,
                "review_id":"k9Ah_ageJzOjBXsD_-5MNw",
                "stars":3,
                "text":"I was in the area and craving for ice caffe mocha at 7:30am. It's located in the Howard Hughes area and parking was easy to find. It is very modern Starbucks with glass windows everywhere. The menu prices are .50 cents higher than Starbucks in Target. Normally Grande ice caffe mocha is $4.45 not here $5.36. This is why I gave 3 stars. I didn't wait too long for my drink to be done.",
                "useful":3,
                "user_id":"EipwmwToR90iinI5aCQoxQ"
            },
            {
                "cool":0,
                "date":"2018-10-07 23:04:07",
                "funny":0,
                "review_id":"ofjnPBmePoOzYN-WQNwI7A",
                "stars":4,
                "text":"Clean,\nFast,\nTypical misspelling of names,\nNice ambiance. \n\nRight close to the strip.",
                "useful":0,
                "user_id":"s8O7xJHKZ1pUWf0n_jeTyA"
            },
            {
                "cool":2,
                "date":"2016-02-23 00:06:54",
                "funny":1,
                "review_id":"vlH9rlmk9yk2VbxZmh_qxQ",
                "stars":1,
                "text":"This Starbucks only gets ONE star because now they are somehow considering themselves the  strip with those higher strip prices (as if their profit margin is small).  $3.19 for a tall americano! Really? What a crock of you know what! Used to come here quite often as did  others but NOT  anymore.  C' YA!",
                "useful":3,
                "user_id":"1_oU3pAMIRhMlLO8X36x8w"
            },
            {
                "cool":1,
                "date":"2014-08-10 00:08:13",
                "funny":1,
                "review_id":"3NCNqNlKnfkih9mwR4LMpg",
                "stars":5,
                "text":"This particular facility gets a five-star yelp review, because in spite of the non-mechanically separated chicken bone from the chicken BLT salad sandwich that I had to return, Joey and his friends were able to help me have a nice pleasant experience.\n\nGreat staff, clean facility, go to location, available parking... all-important but I really want to stress the people making it a satisfying experience.",
                "useful":1,
                "user_id":"lEEYctFjdxJ8eOq_F7OK0Q"
            },
            {
                "cool":1,
                "date":"2015-07-27 01:17:15",
                "funny":1,
                "review_id":"UESxhoxzzhaOMmxy8Ko80w",
                "stars":2,
                "text":"This Starbucks does not put your name on your drinks/food items. Does that not happen on the west coast? Is that an east coast-only thing? I was visiting Vegas and this was the closest Starbucks to my hotel. Went there every morning for 5 days and every single time my coffee was placed on the counter, some other guest would open up my drink or food bag checking to see if it was their item. Gross! This can be easily prevented by simply putting my name on the cup/food bag.",
                "useful":2,
                "user_id":"7kap-X1D2Zp3NkhtLv5xXg"
            },
            {
                "cool":2,
                "date":"2018-10-21 17:34:04",
                "funny":2,
                "review_id":"n-NtVz02nchvJGAphjjn7A",
                "stars":3,
                "text":"It's fine. It's a Starbucks. Mostly all the same. Right? As Starbucks continues it's world domination of the coffee market I think I am starting to see more inconsistencies in their stores than I used to and I have decided to start reviewing them. \n\nI travel for work and I generally try to go to a \"non-Starbucks\" whenever I can but sometimes you need their market penetration. You want a coffee, and there are 4 Starbucks within a block of your hotel. You know?\n\nIt's Vegas. It's just off the strip. I like that it is a stand alone Starbucks and not in a casino or airport. It's pretty big. Plenty of bar top and tables to sit and get some work done.  The store does look to be fairly new.  Wi-Fi of course. Music was playing of course. All the typical Starbucks trappings. \n\nFor those interested it also has a drive thru. \n\nIt feels dirty. Like a lot of Starbucks lately it feels like the place is not well taken care of.  Tables and floor need attention. It's a Sunday, it's mid morning, so I know the place has been hit but come on! Let's grab a rag and do a wipe down. \n\nParking lot is a mess. Judging by how run over the trash is, it's been a few days since anyone has put any effort in out there. \n\nCoffee was fine. I had a blond roast drop and as nearly always is the case, their coffee is not 100% consistent across all stores. Let's just start taking care of the facility a little bit. \n\nCream bar was messy and had only one thermos of I'm not sure what. Not labeled but I took a shot. It was something dairy enough for me. I was looking for half and half so I'm ok. Maybe you can ask if you want something else. \n\nThe pastry case and food shelves looked a little sparse too. Not sure if they were just wiped out or what but it was just messy and empty.  \n\nI feel like Starbucks is just like any other fast food place. The food is consistent. The facility gets hit hard. \n\nThe people were great. Guy that helped me at the register was very nice.",
                "useful":2,
                "user_id":"LdLztTGZPuNmoSRmvxQLyQ"
            },
            {
                "cool":0,
                "date":"2018-10-14 01:57:21",
                "funny":0,
                "review_id":"h7Z7xIqb8KIovspaw3NNaw",
                "stars":5,
                "text":"Perfect place perfect employees if you need a bit rest or a quiet work setting here works.\n\nJust because of my credit card doesn't work while ordering they prepare what I exactly need and serve me gently for free. Thanks guys.",
                "useful":0,
                "user_id":"GQrHc3MphtnZDj5BgwcrlQ"
            },
            {
                "cool":0,
                "date":"2016-02-21 17:45:03",
                "funny":0,
                "review_id":"4auYz9OV4oKAH5n5vK_UPA",
                "stars":5,
                "text":"I normally don't Yelp about chains, especially well established ones like Starbucks because they are already have a great name, but I had such a great experience in such a short amount of time spent here at this Starbucks on Flamingo. This morning I had a little more time before work than normal so I turned around and went to the drive through at this Starbucks. As soon as I pulled up to order, the most genuine voice greeted me, took my order, and I pulled up to the second window to wait for my drink. My barista, Andy, with the same genuine voice greeted me again with a smile, handed me my drink and bid me good day. Sounds like a typical encounter at Starbucks but Andy really made my morning just with the genuine kindness in his voice. Thank you, sir :)",
                "useful":2,
                "user_id":"I70jgmMpKH7qgqr9va28Og"
            },
            {
                "cool":3,
                "date":"2014-12-14 15:43:31",
                "funny":1,
                "review_id":"rqkYqBhtdrQDeWZqYGv_ew",
                "stars":5,
                "text":"They have the Clover brewed coffees! We were flying out of Vegas and we needed a couple of refreshing brews on this hot, hot day. We picked this Starbucks specifically because it was not in a casino, was close to the strip and brewed clover coffee. Even though we didn't try a clover coffee, we wanted to check out the machine and the upscale coffees that are offered at stores with a clover machine. We were not disappointed as this Starbucks was replete with a plethora of exotic coffees. \nThe actual coffee shop was larger than many and had a number of sitting spaces.\n The clientele at the time we were there was eclectic and if you enjoy people watching, this is definitely the place to go.\nAnother plus for this location is that it has a drive through. \nThe barista was quick and delivered a couple of perfect coffees (one vanilla latte and one caramel macchiato).\nAnother wonderful experience at Starbucks.",
                "useful":3,
                "user_id":"diYbASjeqV4CxkoyeBeBGw"
            },
            {
                "cool":0,
                "date":"2016-03-04 20:35:13",
                "funny":0,
                "review_id":"qeRcHShexTRg8Z3kS_67jw",
                "stars":1,
                "text":"Long time Starbucks member, have a gold card, am at a Starbucks almost everyday. I Was planning to get a drink but I had to use the restroom first. The barista was extremely rude, and says, \"its only for paying customers\" with a smug look on her face. I would understand if it was someone who was homeless/ and or transient who was going to use the bathroom for other uses. But I am a student with a backpack here to get some work done, who just really had to pee first. Rude service.",
                "useful":0,
                "user_id":"kIRmhv_GAagDTI8CUAXIrg"
            },
            {
                "cool":0,
                "date":"2018-09-01 18:02:17",
                "funny":3,
                "review_id":"ftg29YGoHy49qgLMGNhs_w",
                "stars":3,
                "text":"Wow, I remember why I quit going to Starbucks. So expensive for a caffeine and sugar rush/crash. I'll stick to making it at home.",
                "useful":1,
                "user_id":"3oDWaCp5w40bGHYmrAofHw"
            },
            {
                "cool":0,
                "date":"2018-05-27 22:37:12",
                "funny":0,
                "review_id":"sPNQcJjbeNZXPU-3cf6O8A",
                "stars":3,
                "text":"***update***Brandon and Chris continue to give great service. Moved to Howard Hughs Blvd and have been using them for 3 months now and I get the best service and the BEST caramel fraps from Brandon.",
                "useful":0,
                "user_id":"EA-UgJmd-hQ8RBn1odmDJg"
            },
            {
                "cool":1,
                "date":"2016-08-02 21:05:16",
                "funny":2,
                "review_id":"5iiq0qgp0ZXlwl_93_umyg",
                "stars":1,
                "text":"Came in for coffee and my order was taken by Michele. She was rude and literally proceeded to yell at her coworker as soon as she finished ringing me up. What a bully. Will never return here.",
                "useful":4,
                "user_id":"6S0C4SwLyVgoIm0N93Mwcg"
            },
            {
                "cool":1,
                "date":"2018-09-12 23:50:18",
                "funny":0,
                "review_id":"_fa64REYF9ddaOSQr3FrXQ",
                "stars":5,
                "text":"This is absolutely my favorite STARBUCKS in Las Vegas!! And a place where people know me by name! What can I say? Awesome customer service, and not to mention the delicious and oh so irresistible coffee! I normally order a iced latte with coconut milk!! Their coconut is worth the extra money and its a great drink without the added pumps of sugar! I will say this location is a tad pricier given they have the same tax as the lv strip! Overall great location and customer service!!",
                "useful":1,
                "user_id":"23WZsw0pLiEMm1nHSqFlKg"
            }
        ]
    },
    {
        "q3kk9PciPb6LpwurlE9eVg":[
            {
                "cool":4,
                "date":"2016-11-10 00:11:48",
                "funny":4,
                "review_id":"e1mjXzIuWW9jBbAaw4tPpg",
                "stars":1,
                "text":"Quite possibly the worst Starbucks location I've been to. There were only 2 cars in front of me at the drive-through so, no, not busy at 2pm. I figured I'd grab some coffee before I fall asleep during a 30-minute drive and this location was on the way after leaving UNLV.\n\nI ordered a GRANDE mocha frappuccino with a shot of espresso, no whipped cream, and chocolate syrup on top. I repeated myself at least 3 times because the lady at the drive through kept saying the wrong thing. What they gave me the first time was a mocha frappuccino with whipped cream and chocolate chips - which was not what I asked for. The lady seemed annoyed. Within 10 seconds, she hands me a TALL (all 2/3 of it, so generous!) mocha frappuccino, no whipped cream, and chocolate syrup on top.\n\nThis would be the last time I'd go to this location. Service and product were both sub par.",
                "useful":7,
                "user_id":"tH0uKD-vNwMoEc3Xk3Cbdg"
            },
            {
                "cool":0,
                "date":"2018-05-08 19:17:24",
                "funny":0,
                "review_id":"SIOLi_9mKVK7mf4N5JGoVA",
                "stars":2,
                "text":"I am sooo upset that I ordered 2 blonde vanilla latte's via mobile app. When I went in after sitting outside for 10 minutes, they guy made me 2 americanos. I ended up waiting for my vanilla latte's and I should have tasted them before I left but I was in a hurry at that point to get to work. I get to work and the latte was literally milk and coffee, no flavor and it tasted so bad I threw it out.",
                "useful":0,
                "user_id":"YsL6vAU_COmCnP0iZk0PGA"
            },
            {
                "cool":0,
                "date":"2015-07-17 11:07:01",
                "funny":0,
                "review_id":"ufjQRLGy7Dz4kEW32PVmKQ",
                "stars":4,
                "text":"I'm comfortable at this location. Fact it's close and open until midnight are positives. The employees as a whole are very good.",
                "useful":0,
                "user_id":"IM4RlcY27r36LWQvjUvLrQ"
            },
            {
                "cool":0,
                "date":"2017-12-03 15:45:26",
                "funny":1,
                "review_id":"Q7WKBx_GU87y709FzQg1Lw",
                "stars":1,
                "text":"If I could, I would give this location NO stars. Unfortunately I have to give at least 1 in order to write a review and warn people about the extremely disrespectful employees at this location. I absolutely HATE this location. I visit starbucks a LOT - on a daily basis (sometimes 2 to 3 times a day), and in all the time I have been a customer with them I have never had such a horrible, humiliating experience. I went through the drive-thru to buy two toffee nut lattes with caramel drizzle around the cup, and a steak tomatillo wrap. When I payed  and received my items, I looked over my receipt and saw that I was charged $0.50 each just for the toffee nut syrup. At first it wasn't a big deal, I just thought \"oh that's new, I don't remember ever being charged for the specific syrup before at any other location.\" So I politely asked a woman named May in the window, \"when did they start charging for the toffee nut syrup? I've never seen that before.\" She rolled her eyes at me, gave me a dirty look, said \"well we do here\", and turned her back to me. I have already had problems with employees in the window giving me attitude at this location once before. I parked out front, went inside, and asked an employee if they could please give me the name of the woman in the window, because I needed it in order to file a complaint with the manager. Now, keep in mind, I have seizures and I stutter when my stress is increased. The male employee turned and laughed through my stuttering as I asked this and told me her name was May. He then continued chuckling and told me, \"you can complain all you want - nobody cares.\" Word. For. Word. No exaggeration. I couldn't take being talked down to there anymore, so I left. I went out to my car and called inside the store from there. A man picked up the phone, and I asked if I could please speak with the manager on shift. He replied, \"yeah that's me, this is my shift.\" I recognized his voice and asked him, \"are you the man I just talked to inside the store? The one who gave me May's name?\" He confirmed it was him I spoke to. So I asked him, \"Oh alright, so what is your name? And you said you're the manger? Because I will be talking to Lauren, the other manager, as soon as I can and telling her about what I experienced today.\" (Lauren is a very nice and polite manager I met the LAST time I had a problem here). He replied, \"My name is Gerardo, but no I'm not a manager.\" I told him, \"Wait a minute, but the first thing I asked when I called was if I was speaking to a manager, and you told me yes.\" He responded, \"No I didn't, because I'm not a manger. We don't have a manager working today.\" So long story short, I highly recommend never coming here. This all was completely avoidable and there was absolutely no reason I should've been treated this way.",
                "useful":1,
                "user_id":"xCNOowgwaoYGR4sZ7o70Yg"
            },
            {
                "cool":5,
                "date":"2014-10-13 15:35:22",
                "funny":3,
                "review_id":"ov9aMRLhVyflKfbQWa-xKA",
                "stars":5,
                "text":"This update is long overdue. I've been visiting this location when I come into town for business or pleasure which is at least once a month.\n\nI usually arrive in the am and the staff here is what make this location so unique and special. Daily customers which I've met two - get their coffee brought to them in regular coffee cups! The staff knows their clients so well they are preparing their orders before they reach the counter. This location also offers the Starbucks Reserve products and has a clover machine for preparation of one cup of reserve at a time!\n\nThank you to entire staff at this location for your outstanding service & quality!",
                "useful":5,
                "user_id":"o4tYl3Hz0oDfpNn4k02DCw"
            },
            {
                "cool":0,
                "date":"2017-03-05 06:32:50",
                "funny":0,
                "review_id":"MUuwKB-t9zy0bfkagYNmUg",
                "stars":5,
                "text":"This is a good starbucks, since it's open late. I think it also makes pretty good use of the space that it has, and it's usually not too busy. Not in my experience, at least. Good place to bring a laptop and put headphones in while enjoying a drink. No problems with the service.",
                "useful":0,
                "user_id":"KYX7kJDSnT2nDBH7SctIfQ"
            },
            {
                "cool":0,
                "date":"2017-08-09 13:46:43",
                "funny":0,
                "review_id":"Pksim-1o7aRocY3NNbv-gA",
                "stars":1,
                "text":"I normally go to this Starbucks once a week before 6:30am. It's convenient cause it's near the strip without paying the hefty prices! Usually they are great with my order. Never got a complaint from me...until today.\n\nI admit I do have a complex drink order. But I'm more than happy to repeating it 2 to 3 times to make sure they get it right. After saying my order to the older lady at the drive thru. She seemed hesitant but told me the price. I get iced espresso with added flavoring, soy and extra ice. This time around I asked for one shot less so I wouldn't be jittery; yet the price was more than my normal order. I assumed they raised the prices again. Pulled forward. Paid my drink and drove off.\n\nIt wasn't until I drove to work that I looked at my drink and saw that the label on my drink said macchiato which explained why the price shot up about 75 cents. After taking a sip or two, it tasted so bitter compared to what I normally get. So I called to speak with the manager. The manager seemed nice enough asking what drink I had. Then I heard the same lady from the drive thru arguing in the background saying it wasn't true. That it was the right drink. She just charged me wrong but I got what I ordered. She proceeded to get on the phone and explain this to me. I was clocking into work so I didn't want to argue over a few cents with someone that was obviously acting defensive.\n\nAfter trying to drink a little longer I realize that there was no flavoring at all. Which I paid more to be put in the drink in the first place.\n\nI'm going to wait until the manager. I was a barista at Starbucks and never did I even think about getting on the phone and arguing with a customer.\n\nI will now take the longer route to go to a different Starbucks. At least that one has some customer service.",
                "useful":2,
                "user_id":"HQUx_q8IhSrJX3GPdUvO_g"
            },
            {
                "cool":1,
                "date":"2015-07-30 01:40:29",
                "funny":1,
                "review_id":"rVw4jojn6ElbQuFPVmeXRg",
                "stars":4,
                "text":"Came to this location before work the other day, and since there was like 4 cars in front of me I thought it was going to take for ever. But surprisingly it was really quick and my order was done correctly. The employee was really nice and friendly. I would love to come back here again.",
                "useful":3,
                "user_id":"SoiacX2r2mvHqIh3GgRMUw"
            },
            {
                "cool":0,
                "date":"2016-01-18 07:03:02",
                "funny":0,
                "review_id":"nKaBZT6jkaeCDhY-TePsAw",
                "stars":4,
                "text":"What can I say about starbucks? Starbucks is starbucks. Now location is another thing. Location here is fine. Size is good. I came here to read a few books and study and the noise was quiet to moderate. The place was kept clean. I don't remember if this is the location that just had the hand drier in the bathroom, usually they also offer paper towels.\n\nThe drinks are pretty universal when you're talking about starbucks. I get the caramel macchiato and it is done. The staff is friendly as well. I also tried one of their fraps which was decent. Another note, I shouldn't complain about starbucks prices but they are relatively expensive. And the line can get a little long.\n\nIn terms of pastries, they are average to good. Starbucks always changes up their pastries so its hard to judge the places. For instance, I used to love getting the chocolate cake pop. Some places have them others don't. Another thing was the rice krispy treats, they seemed to have done away with that completely and now only have the factory wrapped ones which aren't nearly as good. \n\nOther than this I don't have much to say. If you are looking for good coffee and a nice place to read then this is a good place.",
                "useful":0,
                "user_id":"BGZcv3B3mlofVJYG_TTsMw"
            },
            {
                "cool":0,
                "date":"2016-04-23 06:20:29",
                "funny":0,
                "review_id":"RSl8cBW70-Gf0ptH2MzAEw",
                "stars":4,
                "text":"I love it ..so nice staff nice hangout place",
                "useful":0,
                "user_id":"HIIsX5PndKxf5GZtXwprhw"
            },
            {
                "cool":0,
                "date":"2014-02-06 18:18:34",
                "funny":0,
                "review_id":"LMVVcJw8MY-ovxU-DeKXIA",
                "stars":4,
                "text":"The baristas w/o the Jeremy Piven headsets are the most customer service oriented. (IMHO). I guess the headsets are an attempt to be efficient, hip, and techie. But plain ole customer service is dipping slightly. I guess SBUX, once the Pike Place Market of the world, is trying to be the Tiffany/Prada of the world. \nStill, when I travel, I seek out the chain because it is fairly consistent.",
                "useful":0,
                "user_id":"dA7smMo-z6VNmgNzyd640Q"
            },
            {
                "cool":0,
                "date":"2015-04-02 01:55:26",
                "funny":0,
                "review_id":"QaFQDfAZhm3o3xZE1RViOg",
                "stars":1,
                "text":"Wow, who manages this place?  My simple coffee with room for cream was filled to the brim (had to dump some out), but no big deal.  Then my daughter's was made completely wrong (not even close) so they had to remake it but didn't bump it to the front of the queue.  Note that she works at Starbucks so knows how they are supposed to handle this!  Then they made it wrong again!  By that time we just left, not to come back again.  If you think this is a good starbucks you really don't know what the hell you're doing.",
                "useful":0,
                "user_id":"0dOZdotudoK5B54p815q9g"
            },
            {
                "cool":0,
                "date":"2018-08-05 12:50:36",
                "funny":0,
                "review_id":"bepXh7BcDm9kLULJkRYg8A",
                "stars":1,
                "text":"What's up with this Starbucks ? It's sooooo expensive! It's also hard to find and their parking lot is weird kind of reminds me of a maze. For 1 tall frappe and 1 venti frapp... total came to nearly $12. Wow, I won't be back!",
                "useful":0,
                "user_id":"AjQVpSaAihkhQuzszKHzZw"
            },
            {
                "cool":1,
                "date":"2014-02-07 19:42:54",
                "funny":1,
                "review_id":"zd7HkQ0DPgt2QGKYvzgJmQ",
                "stars":4,
                "text":"Seems this particular SBUX thrives on a crowd. The bigger the crowd, the more efficient the staff becomes. Gotta love that! I was maybe 15th in line- but it moved surprisingly quickly. The outside table clean-up is, at best, meh. \nYou get yer caffeine buzz AND yer crowd buzz at this joint.\nHowever, if you order an espresso, and ur eligible for a free re, you gotta get one of their blended coffees- no free re on anything else. To me, their blended coffees are ehh, no good. If you like ur coffee foo-foo'd up, mbe they're alright. I like mine like I like the night-black. No foo-foo.",
                "useful":1,
                "user_id":"dA7smMo-z6VNmgNzyd640Q"
            },
            {
                "cool":0,
                "date":"2016-07-17 21:40:48",
                "funny":0,
                "review_id":"hGDmXMlhlS3y7Q70XYGXFA",
                "stars":5,
                "text":"I have to say they are Number one plays. \nGrate service............ \nI will ceep coming over evryday......\nI will recommend this place allways.........",
                "useful":0,
                "user_id":"ttV7LFe4atjb9c7MZHn7Bw"
            },
            {
                "cool":6,
                "date":"2015-04-17 21:29:29",
                "funny":4,
                "review_id":"GZ6ZXNUHDKaHa3MDOFvQfg",
                "stars":5,
                "text":"Best of them all. Super friendly and fast baristas serve your coffee drink here in this still brand new location. This Starbucks serves as a a/c-ed shelter when the heat is out and as a convenient checkpoint with their drive-through window. \n\nThe industrial/retro design inside is beautiful and the place spacious. The menu offers all the latest Starbucks drinks, including clover coffee.\n\nState of the art!",
                "useful":6,
                "user_id":"HKC-j6ShF_wUfB0q1BH5cw"
            },
            {
                "cool":0,
                "date":"2016-05-09 15:52:32",
                "funny":1,
                "review_id":"eGughuX80FFgP75HX6h-Ig",
                "stars":1,
                "text":"This Starbucks has the rudest employees out of any Starbucks I've been to.  Will never be back to this location.",
                "useful":1,
                "user_id":"R1WlWAzjeMkAg4keap7K4g"
            },
            {
                "cool":0,
                "date":"2017-04-21 19:49:08",
                "funny":0,
                "review_id":"vfbZciKW8LUSHAaObWaQ-w",
                "stars":1,
                "text":"If I can give this place a complete ZERO RATING I would but I can't so there's that. I literally have gone here three time first two times weren't bad at all UNTIL today it was so bad I have to write a review because I'm not coming here again. We pull up to the window and tell this lady our order which I don't think she was listening because she repeated it and was not what we ordered. THEN we repeat the order and she still doesn't get it so I from the passenger side had to shout over my sister to correct this order. After this happened I was like okay well... let's see how the order goes. First I get my strawberry refresher which one had NO strawberries, I only asked her if she would be able to add strawberries she looked at me as if I asked her to give me my money back. Second she gives us the grande drink which the cap of it \"DOESNT FIT\" mind you we are in the car and the drink had whip cream up top. So I asked is there anything that fits the cap she AGAIN looked at me like I was in the wrong. She took it back and said oh I there's nothing that fits, so in my defensive this can't be the first time this has happened people must be complaining about that cause whip cream spilled when she handed us the drink. Not to mention she gave me the food I ordered and then said, \"oh never mind give that back that's not your order.\" Literally just wanted to leave but they still had my damn drink putting strawberries in it during this whole process. SUPER ANNOYED. Not coming back!",
                "useful":0,
                "user_id":"maXQVBpMH4mbwMgHQtr7Ow"
            },
            {
                "cool":9,
                "date":"2014-01-01 00:29:31",
                "funny":9,
                "review_id":"tEpHLvZt8dhsGMD3Xl2IvA",
                "stars":4,
                "text":"Re-locating from the location at 395 Hughes Center Drive where Starbucks hold the memories to remember and recall.  My favorite Starbucks Coffee Shop that just melts me like butter on pancakes, like whipped cream over hot chocolate is now in a newer, bigger location transferring from 395 Hughes Center Dr. to this location by the corner of Hughes Center Parkway, on E. Flamingo Road. So it is a welcoming place as it is a stand-alone building that's newly-built. Wide, panoramic windows lets in the light for a brighter feel with roadside views. Oh, to just people-watch or rather vehicles-passing-by-watch for the watcher in you! As expected, the effervescence of hot brewed coffee permeates the air and lingers to my nostrils' delight! Jazz music adds to the vibe, allowing my senses to relax and imbibe on a beverage of my choice. Take a pick from nice brewed green hot tea, decaffeinated coffee, cool iced tea, delicious coffee, and  various beverages. Choices of baked goods from bagels, to cakes as well as sandwiches and an assortment of desserts, bagels, chips, nuts, meal wraps, dried fruit to whet your appetite. Imbibe, linger, socialize over delicious beverages indoors or outdoors on its small patio under green umbrellas for delighting in the fresh air. Also a breeze of a gain from getting feet off the ground just to obtain the beverage while on-the-run via its Drive-Thru service. Starbucks looks like a little castle surrounded by spaceousness. Ample parking surrounds the new contemporary building. Coffee Hours are from Mondays - Sundays at 4:30 AM - 12:00 AM...that's great hours for the owls and early risers. Coffee servers are ever attentive and happy to serve. Sip your favorite beverages or Coffee, anyone?",
                "useful":9,
                "user_id":"l1CtGHiqB349YrmxjIcgng"
            },
            {
                "cool":0,
                "date":"2017-06-29 07:06:56",
                "funny":0,
                "review_id":"mg5TCeTDtLSY9WH4-dHGkA",
                "stars":2,
                "text":"I really hate leaving a bad review for places but I literally come here EVERYDAY since I live 2 blocks away and the drive thru is convenient. Everyday I order the same exact 2 drinks and everyday they MESS IT UP! If it's not one drink it's the other. I even ask them to say it back to me to be sure that when I get to the window it's  correct.  I've gotten attitude from one of the employees about it the others typically just fix it. But it really is not my fault they can't get it right the first time even after I've told them twice.",
                "useful":1,
                "user_id":"Vag0RBu8MOJuswTIV3aV_A"
            },
            {
                "cool":36,
                "date":"2015-07-30 02:08:38",
                "funny":31,
                "review_id":"OW2RDiTh9nY7va3HHwo4HA",
                "stars":5,
                "text":"I was meeting someone in the area and arrived a bit too early, so I spent the extra time I had at this Starbucks location. I was impressed with the amount of space this one offers and how friendly, helpful and quick the service was that I received. Inside is kind of long and narrow and they have plenty of tables scattered about and a long bar with stools as well a nice long table to that's hard to miss as you walk in. They had plenty of fresh fruit available and the usual pastries. The inside was a bit crowded, so after sitting inside for about 10 minutes I decided to move out to the patio since it was a nice afternoon outside. They have tables and chairs outside the front door and then a spacious patio on the side on the building with tables and chairs. If you are one of those who loves a Starbucks with a drve-thru then you will be happy to find out that is an option here as well. All in all this is a solid location and am glad I stopped by.",
                "useful":40,
                "user_id":"Fv0e9RIV9jw5TX3ctA1WbA"
            },
            {
                "cool":0,
                "date":"2017-11-20 19:48:45",
                "funny":0,
                "review_id":"9oaP-RpxGx9jTsdmgb0h0Q",
                "stars":5,
                "text":"This store rocked this morning!!!  -Vegas Baby!  From the register, to the staff making the drinks, the most efficient operation I've seen at a Starbucks. At the register, I placed three food orders ,three drinks, moved credit from a gift card to a Gold card, receipts given, all handled very quickly. The baristas got the drinks prepared quickly, correctly and efficiently. I was very impressed! I thanked the staff and told them so.",
                "useful":0,
                "user_id":"ZL2OqGvRlTpsB-77PPRwFQ"
            },
            {
                "cool":0,
                "date":"2017-01-05 07:44:34",
                "funny":0,
                "review_id":"AAp2wiaYUrEEucmko_y5WA",
                "stars":5,
                "text":"Michelle was our barista and served us with a smile. She took excellent care of us and was friendly and helpful. I'd go out of my way to stop at this Starbucks again.",
                "useful":0,
                "user_id":"4sTNXclR6TKyIpIS_q6YoA"
            },
            {
                "cool":0,
                "date":"2016-08-27 19:15:06",
                "funny":0,
                "review_id":"9ElEoLMZ93PS8lm6QI0wgg",
                "stars":1,
                "text":"I only gave 1 star because it makes you in order to leave a review. This location is slow and the customer service is terrible. They charged me for the wrong drink which was more money than my actual drink I wanted and then the female Barista decided it was ok to give me attitude about it and didn't refund me the difference. Buy Folgers instant coffee and make it at home out of your toilet before you waste your money on this location. Very disappointing service for Starbucks.",
                "useful":1,
                "user_id":"7VhHZCAX6QoLgQYmxlHPkw"
            },
            {
                "cool":3,
                "date":"2017-03-17 23:00:49",
                "funny":0,
                "review_id":"e3gw6cSNjfbsvcjFD_9_tQ",
                "stars":5,
                "text":"Awesome baristas, great parking and my drink tasted great!",
                "useful":0,
                "user_id":"U5vnrSTvaoFLdaFoe5r1Yg"
            },
            {
                "cool":0,
                "date":"2016-01-07 02:11:10",
                "funny":4,
                "review_id":"rubetdJtF9c_M0H4qDX8oQ",
                "stars":1,
                "text":"HI LOLA !\n\nUr customer service sucks! U need to learn how to talk to ur customers before working at a customer service field ^^\n\nI came in here to order three travelers but went through the drive thru and they said we have to order that inside so we came inside to order them. Then LOLA looks at me and said \"u think u can order that through drive thru?! U have to come into order them\" ok i didnt know so i ordered the travelers (3 of them) and asked how long would it take and she goes \"WELL WE HAVE TO BREW THE COFFEE\" like i know how long it takes to brew three travelers. So i asked her so how long would it take and she looks at me like I AM DUMB and say \"abt 15 mins\" i dont want attitude from u... If u dont like ur job... Please just quit... And do us a favor and not make other ppl feel like shit...\n\nTHANK U ! But please learn how to talk to customers. And dont think that ppl know what u know... I hope i dont see u when i come back here ^^\n\nBy the way beautiful and clean starbucks ... Its just LOLA.",
                "useful":0,
                "user_id":"nKSvzpj6TXUcp_3Kzm1GRg"
            },
            {
                "cool":0,
                "date":"2014-07-01 00:18:29",
                "funny":0,
                "review_id":"YJflzKhp6ac74q7CgZMUEw",
                "stars":5,
                "text":"As a barista at this store I won't leave my biased review :P however, I just wanted to say that the staff will be relieved when I tell them that this is why people take pictures of us sometimes. It was beginning to creep us out a little, hahaha. Also, if we ever had Ethiopia Yirgacheffe for the clover brewer again you REALLY REALLY need to try it!",
                "useful":0,
                "user_id":"1YxH8Wh3yFEebaCTjJwVZg"
            },
            {
                "cool":1,
                "date":"2018-02-25 22:32:28",
                "funny":2,
                "review_id":"L3qS-f5mY1SSTCpAYMqCBw",
                "stars":4,
                "text":"Disclaimer: I can really only speak to the drive-thru, weekday, AM crew. All of my visits to this location have been between 7am and 8:30am. \n\nTo be honest, I try to take advantage of the coffee we have at work. My thought behind this is that if I can save money that would otherwise be spent on Starbucks, I can use that on ordering all the things at a new place on my \"need to try sometime\" list. But, on the occasional \"eff it Friday,\" this is my go-to location for a few reasons:\n\n1. Proximity. It's on the way to work. Enough said there. \n2. Drive thru. It's early. I'm lazy. Sue me.\n3. Service. The woman who usually works the drive-thru window is so bright and cheery that it's contagious. I'd even dare to say that I end up not needing the caffeine boost from the venti pike roast that I usually order. \n4. Speed. I usually arrive before the line is so horrendously long that you decide to walk in and save some time. However, on the few occasions where the drive-thru line snaked beyond the allotted path, the wait was always far shorter than I would imagine. \n5. Ability to redeem rewards. I work on the strip. I usually take in an afternoon treat at the Starbucks nearest to me, but the problem is that location can't take rewards. It's annoying. It's lame. I can't change it. Thankfully, this location gives me a chance to prevent that hard earned overly priced reward from going to waste. \n\nGood, solid, spot.",
                "useful":4,
                "user_id":"5DFshFQlbQiQTvtzH7qwlA"
            },
            {
                "cool":2,
                "date":"2016-04-25 15:55:13",
                "funny":1,
                "review_id":"LL4M7etOGDbhE6YjzuXtkA",
                "stars":5,
                "text":"Open until midnight.. Probably only a few of these in Las Vegas! We had ordered a Caramel  Frapp with extra whip cream and extra caramel. And it was just the way my wife wanted. Very polite barista. Did not wait long. I recommend coming to this one if you want Starbucks late and like the extra toppings on your drinks.",
                "useful":1,
                "user_id":"HNih-GlBsqSvVUIdPlUO9Q"
            },
            {
                "cool":0,
                "date":"2016-08-16 16:03:43",
                "funny":0,
                "review_id":"340WprtfQs43kIG_1KTeRw",
                "stars":1,
                "text":"Waited in the drive through for 35 minutes this morning. It only fits about 8-10 cars. So that's not okay. One car spent nearly 10 minutes at the window. No hello when I got to the window and no sorry for the crazy wait.\n\nAnd on top of that, prices are higher here.",
                "useful":0,
                "user_id":"ZjVS2eUMglYnBfUu-pNXAw"
            },
            {
                "cool":0,
                "date":"2015-04-20 18:56:01",
                "funny":0,
                "review_id":"tn5iR3am0BZjO9LaS8HFPA",
                "stars":2,
                "text":"I guess if you like their coffee this place is for you. This location is perfect for me since it is on the way to work, but I really don't like much of anything they serve. \nSpicy root beer? no, nothing special and it was off the menu the last time I went through the drive thru. Breafast food items are boring and tasteless. \nI tried a berry lemonade thing the last time and it was just expensive and nothing to rave about. Cup overloaded with ice :-(\nStarbucks has their following, but I don't really like anything from this place.\nGreat location off Flamingo and close to the Las Vegas strip, that is about it for me.",
                "useful":1,
                "user_id":"rn2DB_YX0BvToYe50RNr_Q"
            },
            {
                "cool":0,
                "date":"2016-07-07 21:35:55",
                "funny":0,
                "review_id":"PQIurPQ-db8hyW37UWqrKQ",
                "stars":4,
                "text":"I work very close to this location and cannot beat the convenience of a less then five minute drive to satisfy a 2:30 pm coffee craving. Staff is fast, friendly, and efficient. They even offer a $8 lunch special with sandwich, bottled water, chips, and fruit. Great value! The only downside to this particular location is that the prices are HIGHER than the average Starbucks. Overall the convenience factor I feel is worth it.",
                "useful":1,
                "user_id":"KjMt33U4VCs84CQAEn3XUg"
            },
            {
                "cool":1,
                "date":"2014-10-16 11:35:43",
                "funny":3,
                "review_id":"3dZSC-GkADdtmw5yvS2Pdg",
                "stars":5,
                "text":"By far the best Starbucks in Las Vegas! Its a drive through and a Coffee shop, Loved the inside and the retro design and the industrial stools, the staff are really friendly and they know how to serve well, the line is always busy but its goes down real quick! they have an endless menu of different coffees and cold drinks and cakes and pastries, The prices are much cheaper than the rip off Starbucks on the Strip! We drove from the Aria resort to this Starbucks every morning, we loved it that much! \n\nThe WIFI also works great! \n\nits great to just sit enjoy the coffee and people watch, you can even see the planes coming into land at Mccarran Airport! \n\nJust wish the Starbucks in the UK were like this one!",
                "useful":1,
                "user_id":"-3paZwdNXO4zRa55ZQtNkQ"
            },
            {
                "cool":0,
                "date":"2014-06-19 01:32:55",
                "funny":0,
                "review_id":"0raVsy14TE4yUEcaqSjLJw",
                "stars":3,
                "text":"Not sure what other reviewers mean by comfortable seating. Compared to older Starbucks, the seating in here stinks. There are plenty of army type metal chairs and stools, and only three armless, stiff upholstered chairs clustered around a teeny tiny table. Very ultra industrial, with a very, very high ceiling so noise echoes like crazy. Also, the new \"boulangerie\" pastries are pathetic. Everything is tiny and sad looking. But the good news is, for old timer Starbucks customers like me, I can still get a decent cappuccino.",
                "useful":1,
                "user_id":"xmmTvdEBX53B1Fo_B28MNw"
            },
            {
                "cool":0,
                "date":"2017-05-28 22:31:19",
                "funny":0,
                "review_id":"xekIpwckhfFLrPC1Y1z0kg",
                "stars":1,
                "text":"Came here late night around 10pm due to having a long drive coming. To be honest the person taking orders had trouble knowing the menu well which wasn't too big of a deal to me at first. But when my order of a caramel macchiato came out there was no caramel flavoring and was simply just plain iced coffee. After the drinks were handed over to us the straws were also forgotten.",
                "useful":1,
                "user_id":"StDXvY8qiGoobrdvNfbCmA"
            },
            {
                "cool":0,
                "date":"2015-01-08 20:32:18",
                "funny":0,
                "review_id":"C-7vd_KQDxeTratrd0U1Cw",
                "stars":4,
                "text":"Starbucks is Starbucks. Staff is friendly...drive-thru staff can be a bit mechanical...but I cannot blame them.",
                "useful":0,
                "user_id":"AolnyiEB_UMlQtD_dp5E9g"
            },
            {
                "cool":0,
                "date":"2016-05-09 20:16:11",
                "funny":0,
                "review_id":"c-rcTSVE_7dqEZ2NNqAn5A",
                "stars":5,
                "text":"Sharon by far is the most fantastic person there! She has excellent customer service! Lindsay is also a rock star, they are fast and never get my order wrong. I only wish the Starbucks by my house was this good!!!",
                "useful":0,
                "user_id":"I2anZNa50bUSBGSOeL93XQ"
            },
            {
                "cool":0,
                "date":"2015-02-07 20:23:57",
                "funny":0,
                "review_id":"HWtJZDUVmMSYU1aSlO9R1A",
                "stars":5,
                "text":"I absolutely love this Starbucks! It's the most beautiful one in Las Vegas. The customer service is always up to par and I have never had a failed drink here. This is my go to Starbucks for studying, meeting up with friends, or spending some time alone. Totally incredible people and interior! I will be back :)",
                "useful":0,
                "user_id":"c2MQ_LPuvtiiKFR_-OY9pg"
            },
            {
                "cool":0,
                "date":"2018-06-11 20:36:27",
                "funny":0,
                "review_id":"sQRiaG9PdBc8k6CFgHTYZA",
                "stars":4,
                "text":"Brandon is the only one there who understands EXTRA CARAMEL???? Simple... the only time i get it is when hes there.... theyre very good about having it ready snd I seldom wait... taking that into consideration, I gave 4. If I could get my caramel and ONLY 2 scoops of chips, it would be perfect!!!!",
                "useful":0,
                "user_id":"EA-UgJmd-hQ8RBn1odmDJg"
            },
            {
                "cool":0,
                "date":"2015-09-27 18:17:21",
                "funny":0,
                "review_id":"8939-SkSGEf3_ueUUB7W9w",
                "stars":1,
                "text":"We've been waiting for coffee like 20mins. The workers are slowly and new. Not like Starbucks",
                "useful":0,
                "user_id":"-exBZ_Oq2h24lghHh61JEA"
            },
            {
                "cool":0,
                "date":"2017-11-23 21:09:29",
                "funny":0,
                "review_id":"Sa9oiZ58mmzV6hHiizu4Yw",
                "stars":1,
                "text":"Damn!  Super expensive almost double prices. I asked the guy why it is so expensive he replied very rudely. 'Because we are close to strip'.",
                "useful":0,
                "user_id":"zETu83CtWcMBZ3awvBd-ww"
            },
            {
                "cool":0,
                "date":"2014-10-03 08:16:26",
                "funny":1,
                "review_id":"wjR2SPyFDgS-M6WXyDsbBw",
                "stars":5,
                "text":"Nice store, and the staff always does a GREAT job.  Excellent move on the relocation from the old store next to FedEx Kinkos.  \n\nOnly complain is I wish they had bathrooms that could be accessed by multiple people, as it seems like someone is ALWAYS in the bathroom at this place when you need to use one.",
                "useful":1,
                "user_id":"-8APNXHR8Zk3Pm43d1M4QQ"
            },
            {
                "cool":0,
                "date":"2016-10-03 19:17:42",
                "funny":1,
                "review_id":"rdjzXzG74jzKontsgALE3A",
                "stars":5,
                "text":"I LOVE this Starbucks! Michele was very kind and smiled the entire time she was talking to me at the register! I loved my drink and will be back very soon!!",
                "useful":0,
                "user_id":"KH3Org6LXUpI9pWCQ6kX4w"
            },
            {
                "cool":1,
                "date":"2017-12-21 00:02:59",
                "funny":1,
                "review_id":"GjVN1J_u8alU1xddQh86cw",
                "stars":5,
                "text":"Was a bit hesitant about this location given their recent reviews. Nonetheless, my Venti Pumpkin Spice Frappe and Venti Gingerbread Frappe was well made by Landon! Excellent service, lots of indoor and outdoor seating, and of course yummy drinks.",
                "useful":1,
                "user_id":"CpntrjFnW2YWZ0yIPTd2ZA"
            },
            {
                "cool":0,
                "date":"2016-07-08 18:01:38",
                "funny":0,
                "review_id":"wCB0or9hHCgMOxgwaG0ZIQ",
                "stars":1,
                "text":"I would really appreciate a nice staff. An older lady that works every morning in the drive thru window is really rude and a smart ass. They messed up my drinks a few times and when I call to complain in the nicest way ever, they are rude as hell. Service sucks 80% of the time.",
                "useful":1,
                "user_id":"whq8yA_0x7wYKS8breMoZw"
            },
            {
                "cool":0,
                "date":"2015-03-23 13:12:47",
                "funny":0,
                "review_id":"_QDqWYhysjzwXRCstoDLkg",
                "stars":2,
                "text":"This location is notorious for having way to many homeless people with all their baggage and belongings. This is the type of stuff that has been fished out of dumpsters and now creating a health hazard as well as a fire hazard by blocking walkway. I witnessed a homeless person with 4 bags and suitcase sleeping in the store and I asked the employee to wake her up and ask her to  leave. The employees response was, she's a paying customer too. I then stated the health issues she was causing and the employee did nothing to remove this person. Totally disgusting and I hope Mr. Schultz does something to address this issue.",
                "useful":0,
                "user_id":"C6GA6IHglhhDSEsYstQR0A"
            },
            {
                "cool":0,
                "date":"2017-03-07 21:19:52",
                "funny":0,
                "review_id":"M9-aQOITns-WwZyNL1xwrQ",
                "stars":2,
                "text":"I come here often for the convenience it allows me to be in the vicinity of LVBD. What I've noticed is that this place has become a Hobo hangout. I feel slightly awkward in leaving personal items behind when going to the restroom. The restrooms have been becoming increasingly dirty to the point that they put key-code locks on the bathrooms (I'm assuming to curtail their homeless-persons issue). You will find yourself competing for seats with the hobos. I'm sure they are trying to fix the issue or at least I hope they are. Otherwise, the service is great. The location is ideal and the building is relatively new.",
                "useful":0,
                "user_id":"JjarhVHb3O74q6Cle2_EuQ"
            },
            {
                "cool":0,
                "date":"2017-02-25 13:52:25",
                "funny":0,
                "review_id":"W9IlmDi4DdVF8TP-K3_Ztw",
                "stars":4,
                "text":"For all the bad reviews I had a good experience.  I was Driving thru and had to get a hotel in Vegas just to sleep before driving on.  Hotel was a dump so wanted to leave soon as I woke at 5am. No line at this Starbucks and the employees were super friendly.  Price for my drink was only 75 cents more than LA - not too awful.  Barista made my drink perfect!! And it was custom. \nNo 5th star only because the Manhattan Beach Starbucks at pier will always be best in world hah.",
                "useful":0,
                "user_id":"d7pgp3_CMGvrlzsQ0BFcdQ"
            },
            {
                "cool":0,
                "date":"2018-04-18 15:16:22",
                "funny":0,
                "review_id":"8yfktrGL8x_1IaDHj1at2Q",
                "stars":4,
                "text":"A pretty busy spot but a great neighborhood location to pick up some fresh coffee in the morning.",
                "useful":0,
                "user_id":"5BpOyawXDHN1_YKd4i9QbQ"
            },
            {
                "cool":0,
                "date":"2014-12-07 20:45:01",
                "funny":0,
                "review_id":"Nvys5NPyWIjal9RKoUA2Yg",
                "stars":2,
                "text":"They screwed up my drink twice and finally made it right the 3rd time. I'm talking major screwup, like a grande latte instead of the ice Venti Vanilla latte I ordered. Oh and it took 20 minutes from when I pulled into the drive through til actually leaving the window. I could see people getting upset in their cars. I hope it's not always like this.",
                "useful":2,
                "user_id":"f5AzyVdIDASkl8kAJSZq7Q"
            },
            {
                "cool":0,
                "date":"2016-08-17 20:40:47",
                "funny":2,
                "review_id":"tLnJvo3uK977VKyhEdI2OQ",
                "stars":2,
                "text":"Just stopped by this location for an iced beverage. Paid order with a gift card and had a balance owing of $1.50 towards the purchase. I pulled out my debit card and was asked to produce ID.  R u kidding me?  You're worried about a $1.50 charge from a local being fraudulent but you'll gladly remake a $6 drink if it's not right?  Demeaning and uncalled for.  No thanks I'll go back to the suburban locations for my coffee fix",
                "useful":0,
                "user_id":"7fg1fuiUxFeWXWhuVo_PpA"
            },
            {
                "cool":0,
                "date":"2017-04-23 14:24:18",
                "funny":0,
                "review_id":"WPE3yY21AV3BClMpgVZK_Q",
                "stars":5,
                "text":"We stopped in before heading out on our Saturday night and the staff was super friendly and our order was ready very quickly. No complaints!",
                "useful":0,
                "user_id":"dZjO7sHqtLG_QdSUImOyjQ"
            },
            {
                "cool":0,
                "date":"2016-08-31 20:55:28",
                "funny":0,
                "review_id":"_ewGiyLTAkjA5kWaJfLKhQ",
                "stars":4,
                "text":"I come here at least twice a week, either for myself personally or for my office. It is always a pleasant experience. The drive through service is always quick and efficient even during peak hours!",
                "useful":0,
                "user_id":"_49YvRKEHGE8KJ7fHDfiNA"
            },
            {
                "cool":0,
                "date":"2015-07-09 17:04:39",
                "funny":0,
                "review_id":"akN7wQzl20aFXCm_c2iMhw",
                "stars":5,
                "text":"Wow! Great experience! Went in for breakfast, iced tea, and iced coffee before daughters dance competition. Cashier was genuinely nice. Not over the top but just a genuine person. They called us up for our breakfast sandwich and she had labeled our order \"tiny dancer\". We were feeling so tired from the night before and this was such a great pick me up for the morning! Thank you Starbucks team for making our day and kicking us off with a small act of cuteness that had a big impact to our morning! Oh, and the drinks were great too. :)",
                "useful":0,
                "user_id":"3-LG78W00O6f6isG0ijClQ"
            },
            {
                "cool":0,
                "date":"2018-07-29 20:58:45",
                "funny":0,
                "review_id":"NzzvGsoH6DzS5-A8bBJgwQ",
                "stars":1,
                "text":"Worst cup of coffee ive ever gotten at any establishment. They also got our order wrong. My girlfriend did love her Strawberry whatever it was, but mine was just... no flavor, not what I ordered, and overall disappointing. I'm sure that maybe someone was new, or it was on off-day, or SOMETHING. Anyway, not worth what I payed for.",
                "useful":0,
                "user_id":"sfRZj4CH4dU4YT42pvNFJw"
            },
            {
                "cool":0,
                "date":"2018-07-31 16:42:53",
                "funny":0,
                "review_id":"NKeDpk7_alZUDEK29vqf4g",
                "stars":3,
                "text":"Love you guys but when you spend $5.35 plus tip for these delicious egg bits and they are undercooked with consistency of hot jello, kinda feel ripped off",
                "useful":0,
                "user_id":"F9FxxG9BSrIh8Ii_qjFvtA"
            },
            {
                "cool":0,
                "date":"2017-03-08 22:58:31",
                "funny":0,
                "review_id":"tGyg_v8_XyBNoqx7WPBBVA",
                "stars":1,
                "text":"Worst Starbucks in town. Having to work in the same plaza and having this as the only option is frustrating. Having worked in this area for years the turnover is ridiculous every week it's a different person taking your order. This wouldn't be an issue if they didn't get he orders wrong 50% of the time. When you ask to have the order corrected the staff looks at you like it's your fault. Not to mention that this location somehow gets to charge Strip prices while being blocks and blocks away from the strip.",
                "useful":0,
                "user_id":"yCnrXvviTl-_Gcf88YmNtg"
            },
            {
                "cool":1,
                "date":"2014-01-26 03:34:43",
                "funny":1,
                "review_id":"FoW86s21TpDgcwrGhUAONQ",
                "stars":3,
                "text":"This Starbucks is a very cute location, but I was surprised at how little seating is available compared to how big the building appears. I got a grande mocha Frap, which was as good as any mocha Frap I could get at other locations.",
                "useful":1,
                "user_id":"zI0cogkqx4WQArqzTHXd-Q"
            },
            {
                "cool":0,
                "date":"2016-05-13 20:40:40",
                "funny":0,
                "review_id":"yV661wxcRssGM8lVZl8YHQ",
                "stars":4,
                "text":"I work in the offices near this Starbucks. It's a convenient location and has a drive-through, which I love. They also now offer the Starbucks pick up where you can order your drink via their mobile app then go in and pick it up. I recommend doing this because the drive-thru here can get really crazy. Especially during peak hours. When the line is really long for the drive-thru I usually just go inside and order because the drink gets made a lot faster. When the place is busy they also run out of parking spaces so you have to park on the dirt to the left of the building.\nThe only reason why I don't give them 5 stars is because the prices at this location are ridiculous. They charge more because they are so close to the strip and they get a lot of tourists, but still, I shouldn't have to pay over $5 for a venti iced tea. At any other Starbucks location my tea is usually around $3.75. This location has raised their prices around two or three times in the past 2 years. I used to come here more often but now I just can't bring myself to spend $5 on a drink.",
                "useful":1,
                "user_id":"lHFkt91UFwQUywggO8yDHA"
            },
            {
                "cool":1,
                "date":"2014-03-07 18:44:26",
                "funny":1,
                "review_id":"7RgYMvkVai3GiCcCucAgHA",
                "stars":5,
                "text":"I always go through the drive thru and they are so efficient and always so warm and friendly early in the morning. Love the new building and little drive thru. They are sooo efficient and have the process down like clockwork.",
                "useful":1,
                "user_id":"LubOvS08WwKTWugQ2V9_1Q"
            },
            {
                "cool":0,
                "date":"2017-09-04 21:00:27",
                "funny":0,
                "review_id":"TvDfygDdh7xhCjgd6GQ2sA",
                "stars":1,
                "text":"never go to this starbucks there was a cockroach in my coffee this morning, it was very disgusting so i came back and they did not even give me an explanation",
                "useful":0,
                "user_id":"vx8yHeaKnfXF_3UzBgqRjA"
            },
            {
                "cool":0,
                "date":"2017-09-14 23:22:31",
                "funny":0,
                "review_id":"uceasA3kz88M1VMXOmIsvQ",
                "stars":1,
                "text":"Prices here are 22% higher ( for my 3 espresso shots ) then anywhere in town just because it's close to strip ( 0.9 miles to be exact ) It's not good enough reason to keep prices higher.",
                "useful":0,
                "user_id":"4_rFGheun09YKJ10_NxA9g"
            },
            {
                "cool":0,
                "date":"2014-03-07 18:13:15",
                "funny":0,
                "review_id":"megi76wLMX5Ve4h2ROHWWw",
                "stars":5,
                "text":"Great location. Modern free-standing location with great service, friendly people, comfy seating & good parking.",
                "useful":1,
                "user_id":"UY0s1RR0WZkpzTnmMnpBxg"
            },
            {
                "cool":0,
                "date":"2015-08-27 01:56:21",
                "funny":0,
                "review_id":"eLeDJQ57Dhrlp7b0Mujxag",
                "stars":2,
                "text":"The communication barrier is too great in the drive thru. Our order was all messed up and the communication was a joke.",
                "useful":1,
                "user_id":"WB5zT2HLKVdJw-XrCmUG0A"
            },
            {
                "cool":0,
                "date":"2016-02-08 03:51:59",
                "funny":0,
                "review_id":"lTe4WwDDfWr-iFQ9KWY7fg",
                "stars":5,
                "text":"I've been coming to Starbucks since I could remember. Point is, I love Starbucks, but I've never written a review or comment about any location or barista. \n\nThis location is close to my house by the university and it's my favorite so far. The baristas are so nice and the drinks are always perfect. The inside is also very nice compared to other Starbucks. \n\nI never knew you could order drinks in a real cup and I saw a barista named Chelsea making a flat white and she make a little design on top! It was so cute and I complimented her on it and she made me one! So very nice of her, made my day, and reminds me why I love Starbucks so much! Thank you!",
                "useful":0,
                "user_id":"AJlJ2shHZM0NxCLvW2BGzA"
            },
            {
                "cool":0,
                "date":"2017-03-11 14:51:27",
                "funny":0,
                "review_id":"IAtEoXF5PFCvpForAuZlQQ",
                "stars":1,
                "text":"Cashier doesnt even greet me or with a smile, she got my order wrong and seemed annoyed when i asked for a remake even though i asked nicely and its not even my fault!! This is the last time im going here! Caffee Bottega across the streets is better, i just thought this was convinient cause they have drive-thru but nevermind.",
                "useful":0,
                "user_id":"r7NCkJbvwc9QAp6udyBF-A"
            },
            {
                "cool":2,
                "date":"2014-05-03 19:08:15",
                "funny":0,
                "review_id":"XQIMU9M-oOM7a5Ma8HLIcw",
                "stars":5,
                "text":"This has got to be my fave Starbucks to-date. Love the interior design. It's so spacious, modern and trendy inside. Service is friendly and fast. The drive-thru is convenient! If you're in Vegas, def check this Starbucks out :)",
                "useful":5,
                "user_id":"9TWgmxmhL_y5zF2s9S2TQA"
            },
            {
                "cool":0,
                "date":"2015-09-18 15:41:37",
                "funny":0,
                "review_id":"NBLAa7J0r_c2DW7RM7gW3w",
                "stars":5,
                "text":"This is one of the best Starbucks in Vegas, definitely the best near the Strip. It's modern, efficient, spacious, and they have plenty of parking. Best of all, they have the order online option with the app so one can avoid the lines.",
                "useful":0,
                "user_id":"Y7yuNThJFQFJ1Jgx-T11WA"
            },
            {
                "cool":2,
                "date":"2015-10-04 08:26:33",
                "funny":2,
                "review_id":"WTwzQOYRLorPAM08aMtnsQ",
                "stars":5,
                "text":"This is the largest of the Starbucks in Las Vegas. And probably the best staff of any of the ones I've been in. I've been in some of them that have employees that appear to be just starting out. \nEven after they've been at it a year or two. But not this bunch; they're friendly, efficient, and\nforever smiling(alliteration is my OCD, I shall not want). I've encountered 20 different employees\nsince I started coming here(03/2015) and all of them know their drill, no matter where they're positioned. The crowd is varied, but the overwhelming demographic seems to be cab drivers.\nAll of them courteous, kind, and faithful to the law of the pack. This starbucks also employes\na feature I hadn't seen at any other SB, a printed label affixed to your beverage cup that gives \ncustomers first name, volume of drink, and description of drink(quad expresso, decaf, ice). They've all but eliminated the infrequent but nonetheless, annoying peccadillo of giving your \ndrink away to someone who doesn't speak inglesi. Perdoname, maestro, tiene mi  cafe. Dame\npor favor. Gracias ,Senor. Vaya bien. While you stumble through the best imitation you can muster, your drink is losing its maxissimo poder. Starbucks creativity to the rescue! They have also got a better line of edibles than the others, featuring my favorite a sandwich made with flatbread, which looks like a thick saltine cracker(1/2\")with a choice of vegetable and chicken,\nor full on veggie innards. Todo es groovy al esta lugar. 24/7, 430AM- Media Noche. Stop in.\nit will make your day.",
                "useful":2,
                "user_id":"PNiDVKKlaUmElNvQkUy6Qg"
            },
            {
                "cool":7,
                "date":"2014-03-10 05:12:55",
                "funny":3,
                "review_id":"HtYVhyY7jGxG054PX4trKw",
                "stars":5,
                "text":"I go to Starbucks every day.  This was my first time at this new location on East Flamingo in the Howard Hughes Center.\n\nThe shop is roomy, it has lots of product (juices, pastries, and sandwiches--typical Starbucks stuff.  The wifi is free and it's fast--faster since Starbucks converted from AT&T to Google for their wifi.  There are two areas to sit outside.  There are some tables along the front and there's a patio on the east side.  Since the building is quite tall, it gives you shade in the afternoon.\n\nThere are plenty of chairs and one long table with stools where you can work with a laptop or just use your smartphone.  It's far enough away from UNLV that students won't walk here to hang, study, and otherwise be their normal pains in the butt as they are across Maryland Parkway from that Bucky.  This will just be a place where the adults come to use Bucky's wifi so they can conduct their businesses from their \"office.\"\n\nThe staff was on the ball today and it was a good stop.  I'll be back again now that I know the store is open.",
                "useful":4,
                "user_id":"PKEzKWv_FktMm2mGPjwd0Q"
            },
            {
                "cool":0,
                "date":"2016-06-29 15:18:13",
                "funny":0,
                "review_id":"t8bnfzXZcXU7JkZJDh6Fqw",
                "stars":5,
                "text":"I had a most pleasant experience at this 'bucks location.  The service was excellent. Props to Albie, my cashier, for being fun and super friendly. I loved the decor. Made me want to hang out here more often.",
                "useful":0,
                "user_id":"M88k2har3onQiS2H86DKPg"
            },
            {
                "cool":0,
                "date":"2015-08-18 12:15:30",
                "funny":0,
                "review_id":"yYK92IWrXb2oRvMhX5K8bQ",
                "stars":3,
                "text":"I'm a Gold member 10 times over.  This location was designed very poorly.  It was exciting seeing this new location being built as this is a very busy store.  Even though it's the most convenient to my work, I only go to this location when I have no time to stop at another beforehand.  With the time and planning involved, this store should have been the flagship to them all.  The inside feels claustrophobic.  There's nothing comfortable about it.  Someone is always standing in front of you.  Parking is a joke.  Staff is off and on mainly cause this store is insanely crowded.",
                "useful":0,
                "user_id":"-HfAVM2M8H4XtKLdQRgHlA"
            },
            {
                "cool":7,
                "date":"2014-01-28 14:51:25",
                "funny":5,
                "review_id":"ZFx3C687wc8E8MuBJR5LPA",
                "stars":4,
                "text":"Only 4 weeks old and a brand new building including a drive through. This is one of the largest Starbucks I've visited. What a difference compared to the original location in Seattle which opened in 1971\n\nThe driveways from Howard Hughes weren't paved yet it's so new. The service was solid and selection of coffee and brew paraphernalia was impressive. \n\nThis will be a regular stop when I'm in town!",
                "useful":10,
                "user_id":"o4tYl3Hz0oDfpNn4k02DCw"
            },
            {
                "cool":0,
                "date":"2016-05-02 20:08:03",
                "funny":0,
                "review_id":"0QXn_rntt9QE1FVBNBr2cA",
                "stars":4,
                "text":"Der Starbucks ist etwas größer mit vielen Sitzgelegenheiten. Das Ambiente ist mal anders, als in den üblichen Starbucksläden.\nDie Bedienung ist schnell und sehr freundlich.",
                "useful":0,
                "user_id":"8XDH2lsPhv0wlLeRoWpTuA"
            },
            {
                "cool":0,
                "date":"2015-03-26 17:29:06",
                "funny":1,
                "review_id":"_qDNzSwnBPaBbbO5JIgnmg",
                "stars":1,
                "text":"What kind of a Starbucks does not put stoppers into their coffee??!! As this lady (who gave me whip cream when I said no whip cream) gave my husband his BLACK HOT COFFEE it spilled over his white Armani shirt. They're lucky we were able to get it out or I would've demanded they pay for it. Should not have older people who can't hear working the drive through or anywhere in the high pressure service jobs. The little details matter and this one could've been costly.",
                "useful":0,
                "user_id":"yvf1-d6OJsD1BT_K3QoKAA"
            },
            {
                "cool":2,
                "date":"2013-12-24 03:49:21",
                "funny":0,
                "review_id":"vIUUrv-o_Lf80vTbpwX42Q",
                "stars":5,
                "text":"This one replaced the location on Howard Hughes (inside FedEx). It is very bright from the floor to ceiling windows. The lobby is spacious and there are plenty of tables. This location has a drive thru and features the new Clover coffee brew machine. The Clover is a specialty machine that brews Starbucks reserve and exotic coffees by the cup. The price of the Clover brewed coffee is a little higher but the coffee is of a higher quality.  Although I'll miss the old location on Howard Hughes from YEARS of being a customer, this one is much nicer.",
                "useful":3,
                "user_id":"3Kn4WUjRW4mktpYa0El3IQ"
            },
            {
                "cool":0,
                "date":"2016-03-04 20:37:31",
                "funny":0,
                "review_id":"KMjwy10AuuduvmaVzt3uGA",
                "stars":2,
                "text":"The employees at this location are great. The district manager should be chastised however. She raised the prices to match \"Strip pricing\". This Starbucks is often filled with taxi and limo drivers. I am a limo driver. Way to stick it to the working people who are the core of your business. I hope your numbers look good on paper because your store reputation is bound to suffer. I'm not coming back.",
                "useful":1,
                "user_id":"-57uOzAWlx__p6QlX1pojA"
            },
            {
                "cool":2,
                "date":"2014-03-09 22:10:24",
                "funny":0,
                "review_id":"6pe3P_yyijiZSTVDCCtXvA",
                "stars":5,
                "text":"This is my favorite Starbucks.   It is a standalone building and it is quite modern.  Yes, the drive thru can be a bit hectic but that is because of its prime location, right off Flamingo.  That is not only great for the Starbucks believers but for the business itself.   Sharon typically works during the AM hours and it is amazing how one person along with a great cup of 'whatever you order' can enhance your day.  She is always pleasant and so friendly.",
                "useful":0,
                "user_id":"xCqqBsp0w0sz6bJWqsCxAg"
            },
            {
                "cool":6,
                "date":"2015-01-29 01:49:02",
                "funny":5,
                "review_id":"OdhtsudtkAPAH3LvEhCkqA",
                "stars":5,
                "text":"This update is long overdue. I've been visiting this location when I visit Las Vegas  for business or pleasure which is at least once a month. Parking is usually not bad but during peak hours it can fill up and you may have to park west in an unpaved lot.\n\nI usually arrive in the am and the staff here is what make this location so unique and special. Daily customers which I've met two - get their coffee brought to them in regular coffee cups! The staff knows their clients so well they are preparing their orders before they reach the counter. This location also offers the Starbucks Reserve products and has a clover machine for preparation of one cup of reserve at a time.\n\nThis Starbucks is one of my favorite locations and  Thank you to the entire staff for the outstanding service & quality!",
                "useful":7,
                "user_id":"o4tYl3Hz0oDfpNn4k02DCw"
            },
            {
                "cool":0,
                "date":"2014-10-24 15:53:36",
                "funny":0,
                "review_id":"P15sgKC6y7e9KJja1B8qQg",
                "stars":5,
                "text":"Great coffee! Wakes me up each and every day. Cannot wait to get my mojo there in the morning. Some days it seems stronger than others but I love it.",
                "useful":0,
                "user_id":"_A5vHoFRXBcmBertTQgoRg"
            },
            {
                "cool":0,
                "date":"2016-11-06 17:08:37",
                "funny":0,
                "review_id":"qsVPDbPEbn6Jix5svEVTwA",
                "stars":5,
                "text":"A great store. Shout out to Lauren for being an excellent manager, although a more appropriate term for her would be \"leader\". Brandon, a shift supervisor who works like there's no tomorrow, and is one of the friendliest people working at this location, and to John Joshua, affectionately called JJ. I've been there for a few months and saw excellent improvement in his skills as a barista, no change with customer service (he already had it!). Congrats on partner of the quarter (as of fall 2016)! Huge thank you to this",
                "useful":0,
                "user_id":"D6J-UXe7xrPPMIT2ipw8Wg"
            },
            {
                "cool":0,
                "date":"2015-07-13 17:24:13",
                "funny":0,
                "review_id":"Q_GKyfPVdgPnVNdnECL93w",
                "stars":5,
                "text":"Love this Starbucks. Always consistent and friendly service. Vibrant atmosphere. Sometimes long lines but they have the staff to move em along quickly. Drinks from Baristas can be quite slow.",
                "useful":0,
                "user_id":"6wWhkHhLMTdnYMPlXRcN9g"
            },
            {
                "cool":5,
                "date":"2018-02-10 00:17:07",
                "funny":3,
                "review_id":"qier4I1t0iKbQXZpAb8bnQ",
                "stars":1,
                "text":"The worst customer service ever !!! Worst Starbucks location all over the nation. The cashier people won't even smile at you ant treat you like they are making you a favor, I let the manager know of how rude they were just to find out that she was even more rude and stupid. \n\nYou incompetent manager girl with purple hair for sure do not represent the company and sooner or later you will find yourself jobless because someone as unprofessional as you are shouldn't be working at this location.\n\nI really hope for someone to read this review and do something about it. \n\nMeanwhile I do not recommend this location to anyone and recommend you to avoid it. On top of it the location looks nasty so if you don't want to catch a virus don't visit this location there's so many other ones with great customer service!!!",
                "useful":9,
                "user_id":"5rXm9JMg9kNYpPdqWbxZpg"
            },
            {
                "cool":2,
                "date":"2015-08-05 07:29:33",
                "funny":2,
                "review_id":"uF8zjM2tf5FYw_WoYty4wQ",
                "stars":5,
                "text":"Can you ever give a Starbucks location less than 5 stars? Though there is just about one Starbucks for every hotel on the LV Strip, this is one of my favorite stations because it is conveniently located near Tuscany (cheap steak and eggs) and the 76 gas station (with super cheap prices too!)\n\nWith the new mobile order it is super easy and convenient for me to create my order while I'm pumping gas or driving down to the Starbucks. If you're not tech-savvy then there's also a drive thru as well. Don't let this store fool you though--it is almost always packed!",
                "useful":2,
                "user_id":"HQnfONrTQKBdHPV7iebtxQ"
            },
            {
                "cool":0,
                "date":"2016-02-19 19:06:45",
                "funny":0,
                "review_id":"fiJ_ChoNGPFF2jU7TTn-Dw",
                "stars":2,
                "text":"I am a local and work on Howard Hughes Parkway.\nI used to love going to this location on my lunch.  Although if it's crowded, it can feel like you are crammed in there, especially during the lunch rush.\nHowever, I went about 2 weeks ago since the weather was nice and I decided to go for a stroll.  I get my Venti Iced Coffee w vanilla and cream.  Typically at any other location besides a the casinos...$3.19.  Here....almost $4.  WTH?!?!?!?!\nI get you are close to the strip however more locals than non locals visit this establishment.  Sooo wrong and you don't have to worry about me returning to this location unless I have a free drink smh.",
                "useful":2,
                "user_id":"xPSXDnjJ_oXoVSlkvmDItA"
            },
            {
                "cool":1,
                "date":"2017-10-23 03:43:56",
                "funny":0,
                "review_id":"trjY90hhtdHZbmkicTBEuQ",
                "stars":1,
                "text":"I love Starbucks and have gone to numerous locations all over the US, esp in NV and CA but I must agree with other yelpers that this locations' customer service and food is mediocre \n\nMy drink order was not as I requested and it came out watery. I ordered a decaf white chocolate mocha frapp with an extra pump of white chocolate mocha. It lacked flavor and I couldn't taste the white mocha. Perhaps they were skimping in ingredients to save money but why? The cost of the drink covers the cost of ingredients!? \n\nUnfortunately my lemon loaf was dry and I was unable to finish it. I thought Starbucks had fresh pastries...that wasn't fresh. \n\nThe Starbucks on the strip cost a lot more but I've never had these problems. Please please please address these issues Starbucks. Thanks.",
                "useful":1,
                "user_id":"Rpw8mQPKJb8esVjosT4Sog"
            },
            {
                "cool":0,
                "date":"2015-06-07 00:50:20",
                "funny":0,
                "review_id":"rwYGaSTNb5MietXJFJtd5A",
                "stars":4,
                "text":"I recently started a new job in this area and like to stop at this location for my coffee fix. With all the other business men and women and visitors from nearby, it can get pretty busy and crowded. The longest I ever had to wait for my order was 13 minutes (it was a pour over, so it is excusable). It all depends on the time of day, i.e. business crowds who are starting work or on lunch break. The staff is friendly and welcoming. I enjoy coming here as it is clean and inviting.",
                "useful":0,
                "user_id":"ka8Pk_MXUXNmPy9kPaO43w"
            },
            {
                "cool":7,
                "date":"2015-03-26 18:19:28",
                "funny":8,
                "review_id":"UTjTqROgkHsAyMn7R_H3UA",
                "stars":4,
                "text":"I know, I know. A review about Starbucks with over a gazillion locations, but I felt the need to call-out one of the good ones. Because we all know Starbuck shops are like Vampires, some sparkle & shine and others just suck the life out of you. \n\nI almost never write reviews about large chains, but this Starbucks has to be the best looking location in Vegas. High ceilings, plenty of room to work, and two, count em', two patios. One in the front and one on the side, both nonsmoking! \n\nThis location also boasts a very fast drive-thru and a hard working crew. When I got here the line was long, which almost caused me to leave, but I noticed how fast it was moving, so I decided to give it a chance. Two minutes later, I'm placing my order and setting up my laptop, and what felt like one minute after that, my drink order is being called out to the caffeine addicted crowd.\n\nMy one and only complaint is, stronger Wi-Fi. As the place began to fill up, the signal seemed to get slower and did cause a little hiccup in my work time.\n\n#FirstWorldProblems.",
                "useful":6,
                "user_id":"i_DR3vdE73nVm2GlMbGpGA"
            },
            {
                "cool":0,
                "date":"2015-10-05 19:57:48",
                "funny":0,
                "review_id":"HpNJSyI3QVlpydDd1dSWLQ",
                "stars":5,
                "text":"In a rainy day like today I feel like I'm in Seattle not Vegas. Location close to the strip without the strip traffic, this brand new building puts out a cool suburban vibe. Tried a skinny Carmel macchiato for the first time and I'm sold! Found my new fave drink for the winter without a whole lotta calories. Meeting my husband here again and again...",
                "useful":0,
                "user_id":"5vNHnhnUWdfGiSnK_QsnwA"
            },
            {
                "cool":0,
                "date":"2016-01-12 22:22:05",
                "funny":0,
                "review_id":"iQEGrva9jvemh1LMsQxqgA",
                "stars":5,
                "text":"I'm a regular at this Starbucks and I always enjoy my green tea latte at this location. When I come here I always look for Albie and Brandon they are amazing!! They make me feel welcome, the drinks are fantastic. They always offer phenomenal  customer service!!! Keep up the great work guys! Ill be seeing you soon!",
                "useful":1,
                "user_id":"3bWF0eTqIM5eXI_0SlCJNg"
            },
            {
                "cool":0,
                "date":"2017-07-06 20:07:53",
                "funny":2,
                "review_id":"gndkkIVXg9ulO-y-lXFPCA",
                "stars":1,
                "text":"To be frank, I love Starbucks.. like who doesn't? Every Starbucks I've been to has been an excellent experience. With great customer service and awesome beverages to top off. But this particular location, I guess they'll have to work on some things. Maybe they missed out on \"customer service\".\n\nI was in a drive-thru, ordering a simple drink. An Iced-Coffee with Soy milk and Vanilla Pumps with EZ ice. A staple. Nothing too complicated there. But it came out wrong and when I asked for it to be remade.. I get an attitude? Huh? Did I miss out on the motto that Starbucks stands for? If the drink isn't up to part, they will offer replacements to meet customer satisfaction? \n\nClearly there was miscommunication but it could've been avoided if their staff were to listen and probably repeat the order and not assume they noted it down? I'm not sure if this particular staff is having a bad day or something but cmon, we (customers) don't have time for your sass. Get your act right because I ended up having a diluted/watered down coffee.. thanks.. \n\nI believe his name tag was Josh?",
                "useful":1,
                "user_id":"cMva3C2QbmmvW1flAwsNVQ"
            },
            {
                "cool":0,
                "date":"2014-02-04 00:57:26",
                "funny":0,
                "review_id":"GHXsRNchiPL43J7YciP1yg",
                "stars":4,
                "text":"Busy place every time I've gone. So many offerings and combinations , it must drive the staff bonkers. They are about as friendly and efficient as they can be though.\nI have to order a \"clover made\" coffee now that SBUX only offers blends, which I don't like at all. Makes me spend more which I don't like either.\nI do like the clover coffees, but I don't like the thought that in order for ME to get what I like, I cannot simply order the regularly brewed coffee ( since it's always blended with coffees I dislike). \nI've been to several SBUX in LV, and this IMHO, had the most outside seats, friendliest staff, and best choices. \nOf all the chain stores in the world ,\nSBUX is the only one I consistently\nseek out. However, their switch to \"blended coffees\"  as well as the consistently weak WiFi (I usually switch to my carrier's LTE) is causing me to re-evaluate my loyalty to SBUX.",
                "useful":1,
                "user_id":"dA7smMo-z6VNmgNzyd640Q"
            },
            {
                "cool":3,
                "date":"2015-12-31 23:47:45",
                "funny":2,
                "review_id":"6gdt14CZY0wjLKkXtyE_-Q",
                "stars":3,
                "text":"Today was my first time at this Starbucks and eh I have experienced better service as well as the quality of drinks. I pulled through the drive thru with no cars ahead wasn't greeted right away. Once I placed my order I had to repeat it twice and then when I got to the window I sat for another 3 minutes until I was acknowledged. Once I was got my drink it was incorrect.. So I'm not sure how hard an iced quad espresso with cream is but the barista forgot my cream and the lady working the window fixed it however when handing it to me had the coffee dripping all over the sides just a mess ugh I guess I'm spoiled or whatever you want to call it but I wasn't impressed to say the least.. It's a nice location though...",
                "useful":2,
                "user_id":"qPVtjjp8sNQ32p9860SR9Q"
            },
            {
                "cool":0,
                "date":"2014-08-07 02:31:32",
                "funny":0,
                "review_id":"cH7TvDKilHDdK4kmDWNFwg",
                "stars":3,
                "text":"I am 100% a Starbucks fan. Almost never does a day go by without me having some product from Starbucks. Today I had a Trenta Iced Coffee and a Pellegrino. The service was fast and pleasant. My drink was prepared perfectly. This location is different from just about every location I've ever been to. It is deceptively roomy with several types of seating areas. My ONE complaint - and it's a big one - is that most of the outside seating area is unusable as it smells of urine. Undoubtedly the small fenced in cement seating area (charming design) has become the sleeping place for homeless people. PLEASE steam clean this area and do something about it. It so weakens this location which would otherwise be one of the nicest I've seen.",
                "useful":2,
                "user_id":"9qeb4Z0BfIJ9Uz62TR2foQ"
            },
            {
                "cool":0,
                "date":"2018-02-07 19:19:06",
                "funny":0,
                "review_id":"0SJ8AZmHuzr6ABJu9j5WOg",
                "stars":5,
                "text":"I have been going to this Starbucks location for the last 4, almost 5 years and I must say their morning crew is absolutely amazing! They are very friendly, welcoming, helpful and make my daily Starbucks run very delightful! My orders are always correct and due to my Starbucks \"addiction\" a lot of the crew knows it by heart now. What can I say I like my daily Starbucks!",
                "useful":0,
                "user_id":"1AmTCSKt05ejbTtrPiqXjw"
            },
            {
                "cool":1,
                "date":"2016-05-15 20:14:46",
                "funny":1,
                "review_id":"nZs9D_Pijn6a7gbvdO-A4g",
                "stars":1,
                "text":"Took 20 minutes in the drive-through just to receive my food they didn't even fill my latte all the way the guy also did not include any napkins with my egg and sausage sandwiches. I go to Starbucks regularly and this is by far the worst Starbucks at ever been to.The egg and sausage sandwich tastes like it is been sitting out for four hours and I just threw it in the microwave.",
                "useful":1,
                "user_id":"RmQSnsotL9fGai71YfVM_Q"
            },
            {
                "cool":1,
                "date":"2014-06-23 21:44:32",
                "funny":1,
                "review_id":"dbygVbbY0rEbgVplHQoMug",
                "stars":3,
                "text":"I think this location is pretty uncomfortable inside. Lots of army style metal chairs, and only 3 armless upholstered chairs clustered around a small table. Also, the new \"boulangerie\" pastries are tiny and unappetizing in appearance. The good news for old timer Starbucks customers like myself, is that I can still get a good cappuccino.",
                "useful":3,
                "user_id":"xmmTvdEBX53B1Fo_B28MNw"
            },
            {
                "cool":6,
                "date":"2016-03-23 22:59:48",
                "funny":5,
                "review_id":"2qaaPt67ucAZNW_RuLeAgQ",
                "stars":4,
                "text":"There's a lot of Starbucks along the Las Vegas strip, but most of them charge two bucks or more then the corporate Starbucks. Some of the locations don't even accept the Starbucks card AND they add the upcharge to their prices.  \n\nStarbucks is already expensive, so it was worth driving 2 minutes away from the Strip to enjoy my London Fog Latte.  Located in the same parking lot as Fogo de Chao and McCormick and Schmidt's, this Starbucks was built about a year ago. It's not a particularly big Starbucks, but there is a communal table and scattered seating and tables inside and outside.  Power outlets are on the floor.\n\nThis place has a drive-through, and they also accept mobile orders. They have all the souvenir mugs and cups too. While the service was good, I thought some of the baristas could be slightly friendlier.  \n\nFor the Californians, remember Nevada charges sales tax for food and beverages... including the refills which are $.055",
                "useful":10,
                "user_id":"cKJ0r01eF7E-tYp2FQOyRA"
            },
            {
                "cool":0,
                "date":"2016-01-04 00:08:15",
                "funny":0,
                "review_id":"QOyWG1RX5R-YfCEj00aWVA",
                "stars":2,
                "text":"Service was fine, staff tried to be helpful, but they didn't have what I wanted.\n\nAlso, I don't like the layout. It feels very cramped with people jammed together into a long, narrow space. The tables and chairs weren't that comfortable. It doesn't have the 'feel' of a place I would want to linger.",
                "useful":0,
                "user_id":"W3Q7UeLJ9FLVoM1sT4W-wQ"
            },
            {
                "cool":0,
                "date":"2017-02-28 06:22:25",
                "funny":0,
                "review_id":"4ycicSFXh-58_ayMAdQc1g",
                "stars":5,
                "text":"Service was good! Atmosphere was pleasant, free wifi and lots of seating! We sat in there for over an hour chatting away, it's pretty small, so Eve's dropping and people watching is all but forced upon you whether you like it or not! \nAlso the bathrooms were clean which is always a nice perk.",
                "useful":2,
                "user_id":"I_6or9vQiL9qoSz5PuW4fg"
            },
            {
                "cool":2,
                "date":"2018-06-11 20:56:48",
                "funny":0,
                "review_id":"As7rDxltQu7vcAxNjmlxDA",
                "stars":5,
                "text":"Starbucks is definitely a place where you know what you are going to get and its process is in place to ensure that you receive exactly what you order and get great customer service. They also have processes in place if you don't get 5 star service. I have been to this location several times in the evenings and my experience has been great.",
                "useful":4,
                "user_id":"Q7IoE5m2heQKThuVq3SYFA"
            },
            {
                "cool":0,
                "date":"2016-03-16 18:04:11",
                "funny":0,
                "review_id":"DlV3E6AzBgG8l9X9St5uMg",
                "stars":5,
                "text":"I have a few of my meetings here at this Starbucks. I like the layout, it's comforting to be around the buzz of other business people having their meetings. Today I had the pleasure of having Josh make my coffee... I forgot to tell him to steam my soy milk for my coffee. When I went back and said \"sorry Josh, I need my coffee to be hotter.. can you steam my soy milk as well?\"\nJosh said \"no problem\" made me a new one! Thanks Josh!",
                "useful":0,
                "user_id":"7XtjpwvWhYd08c6qF-YyAA"
            },
            {
                "cool":23,
                "date":"2015-04-14 01:43:55",
                "funny":17,
                "review_id":"oeVW4nj9K1VFvPgbziWZgw",
                "stars":5,
                "text":"Yes I'm writing a review on the heavy hitter chain that is Starbucks - don't judge. I felt compelled to give a short but sweet shout out to this location because the baristas here are whipping up my favorite drinks exactly the way I like them - strong and not watered down! \n\nI hate being stuck on the strip with the need for caffeine because we don't enjoy spending premium prices for Starbucks. This convenient location \"near\" the strip is our favorite spot. So far, the baristas here can really make our drinks well so keep this spot in mind the next time you are headed to the strip.\n\nThe interior situation is roomier than the previous review made it out to be. There is a long bar in the middle with lots of counter space to post up with your laptop with tall stools to sit in, a few tables and also some comfy seats scattered along the window of the shop. There is also a generous amount of seating outside in the front and side!\n\nBONUS: No shortage of outlet sockets to plug in your electronics. The clean bathrooms are tucked away near an entrance for easy ins-and-outs without making that awkward walk of shame through the whole darn place.",
                "useful":21,
                "user_id":"u_wqt9RshdZsoj8ikLqoEQ"
            },
            {
                "cool":0,
                "date":"2018-01-31 18:50:03",
                "funny":0,
                "review_id":"H7PlMa0gM4GZfcYi7kQPgg",
                "stars":2,
                "text":"Slow service every time I've visited. Not the staff's fault - I don't think they can keep up with the drive-through and the folks inside.",
                "useful":0,
                "user_id":"DD5irerFNGQeu8eM0W3Ylg"
            },
            {
                "cool":0,
                "date":"2018-10-28 22:17:28",
                "funny":0,
                "review_id":"DM0SsynndOW5t67PNmYDuA",
                "stars":1,
                "text":"Is this even a Reserve bar?! The guy behind the counter had no idea what I was talking about.  I thought all Reserve Bars had the ice cream drinks- but the barista looked insanely puzzled. We went out of our way to hit up a Reserve, but be warned- they are not all the same. This place only seemed to advertise the pour-over coffees (although I didn't see the fancy chemistry sets that are used to make it). I think this a fake Reserve.",
                "useful":0,
                "user_id":"PHrJYYJOkQa3KOyLiLCAww"
            },
            {
                "cool":2,
                "date":"2017-11-29 23:53:57",
                "funny":1,
                "review_id":"kuweeYUoHOVoq727kaMJxw",
                "stars":3,
                "text":"I will admit that the service at this location is very good and quick but for some reason our drinks never come out right. I ordered my pumpkin spice frap and it came out really watery and milky. \n\nIt was strange. I've never had issues with any drinks from Starbucks so I just thought it must have been a one-time mistake but after the second remake, it still looked the same. I gave up and tossed my drink.",
                "useful":2,
                "user_id":"V4ufnFKJNV8kEwFMx_5qEw"
            },
            {
                "cool":0,
                "date":"2017-03-03 09:57:40",
                "funny":0,
                "review_id":"GY3FXjD1NxNCllKdkri0og",
                "stars":5,
                "text":"There Customer service was grate.\nThe coffe was grate.\nI will come again for shore.\nFood was fresh..\nBest plays to ...............",
                "useful":0,
                "user_id":"hGUUJtJjh1TkmF3lRorBQA"
            },
            {
                "cool":2,
                "date":"2017-12-12 01:50:36",
                "funny":1,
                "review_id":"k9Ah_ageJzOjBXsD_-5MNw",
                "stars":3,
                "text":"I was in the area and craving for ice caffe mocha at 7:30am. It's located in the Howard Hughes area and parking was easy to find. It is very modern Starbucks with glass windows everywhere. The menu prices are .50 cents higher than Starbucks in Target. Normally Grande ice caffe mocha is $4.45 not here $5.36. This is why I gave 3 stars. I didn't wait too long for my drink to be done.",
                "useful":3,
                "user_id":"EipwmwToR90iinI5aCQoxQ"
            },
            {
                "cool":0,
                "date":"2018-10-07 23:04:07",
                "funny":0,
                "review_id":"ofjnPBmePoOzYN-WQNwI7A",
                "stars":4,
                "text":"Clean,\nFast,\nTypical misspelling of names,\nNice ambiance. \n\nRight close to the strip.",
                "useful":0,
                "user_id":"s8O7xJHKZ1pUWf0n_jeTyA"
            },
            {
                "cool":2,
                "date":"2016-02-23 00:06:54",
                "funny":1,
                "review_id":"vlH9rlmk9yk2VbxZmh_qxQ",
                "stars":1,
                "text":"This Starbucks only gets ONE star because now they are somehow considering themselves the  strip with those higher strip prices (as if their profit margin is small).  $3.19 for a tall americano! Really? What a crock of you know what! Used to come here quite often as did  others but NOT  anymore.  C' YA!",
                "useful":3,
                "user_id":"1_oU3pAMIRhMlLO8X36x8w"
            },
            {
                "cool":1,
                "date":"2014-08-10 00:08:13",
                "funny":1,
                "review_id":"3NCNqNlKnfkih9mwR4LMpg",
                "stars":5,
                "text":"This particular facility gets a five-star yelp review, because in spite of the non-mechanically separated chicken bone from the chicken BLT salad sandwich that I had to return, Joey and his friends were able to help me have a nice pleasant experience.\n\nGreat staff, clean facility, go to location, available parking... all-important but I really want to stress the people making it a satisfying experience.",
                "useful":1,
                "user_id":"lEEYctFjdxJ8eOq_F7OK0Q"
            },
            {
                "cool":1,
                "date":"2015-07-27 01:17:15",
                "funny":1,
                "review_id":"UESxhoxzzhaOMmxy8Ko80w",
                "stars":2,
                "text":"This Starbucks does not put your name on your drinks/food items. Does that not happen on the west coast? Is that an east coast-only thing? I was visiting Vegas and this was the closest Starbucks to my hotel. Went there every morning for 5 days and every single time my coffee was placed on the counter, some other guest would open up my drink or food bag checking to see if it was their item. Gross! This can be easily prevented by simply putting my name on the cup/food bag.",
                "useful":2,
                "user_id":"7kap-X1D2Zp3NkhtLv5xXg"
            },
            {
                "cool":2,
                "date":"2018-10-21 17:34:04",
                "funny":2,
                "review_id":"n-NtVz02nchvJGAphjjn7A",
                "stars":3,
                "text":"It's fine. It's a Starbucks. Mostly all the same. Right? As Starbucks continues it's world domination of the coffee market I think I am starting to see more inconsistencies in their stores than I used to and I have decided to start reviewing them. \n\nI travel for work and I generally try to go to a \"non-Starbucks\" whenever I can but sometimes you need their market penetration. You want a coffee, and there are 4 Starbucks within a block of your hotel. You know?\n\nIt's Vegas. It's just off the strip. I like that it is a stand alone Starbucks and not in a casino or airport. It's pretty big. Plenty of bar top and tables to sit and get some work done.  The store does look to be fairly new.  Wi-Fi of course. Music was playing of course. All the typical Starbucks trappings. \n\nFor those interested it also has a drive thru. \n\nIt feels dirty. Like a lot of Starbucks lately it feels like the place is not well taken care of.  Tables and floor need attention. It's a Sunday, it's mid morning, so I know the place has been hit but come on! Let's grab a rag and do a wipe down. \n\nParking lot is a mess. Judging by how run over the trash is, it's been a few days since anyone has put any effort in out there. \n\nCoffee was fine. I had a blond roast drop and as nearly always is the case, their coffee is not 100% consistent across all stores. Let's just start taking care of the facility a little bit. \n\nCream bar was messy and had only one thermos of I'm not sure what. Not labeled but I took a shot. It was something dairy enough for me. I was looking for half and half so I'm ok. Maybe you can ask if you want something else. \n\nThe pastry case and food shelves looked a little sparse too. Not sure if they were just wiped out or what but it was just messy and empty.  \n\nI feel like Starbucks is just like any other fast food place. The food is consistent. The facility gets hit hard. \n\nThe people were great. Guy that helped me at the register was very nice.",
                "useful":2,
                "user_id":"LdLztTGZPuNmoSRmvxQLyQ"
            },
            {
                "cool":0,
                "date":"2018-10-14 01:57:21",
                "funny":0,
                "review_id":"h7Z7xIqb8KIovspaw3NNaw",
                "stars":5,
                "text":"Perfect place perfect employees if you need a bit rest or a quiet work setting here works.\n\nJust because of my credit card doesn't work while ordering they prepare what I exactly need and serve me gently for free. Thanks guys.",
                "useful":0,
                "user_id":"GQrHc3MphtnZDj5BgwcrlQ"
            },
            {
                "cool":0,
                "date":"2016-02-21 17:45:03",
                "funny":0,
                "review_id":"4auYz9OV4oKAH5n5vK_UPA",
                "stars":5,
                "text":"I normally don't Yelp about chains, especially well established ones like Starbucks because they are already have a great name, but I had such a great experience in such a short amount of time spent here at this Starbucks on Flamingo. This morning I had a little more time before work than normal so I turned around and went to the drive through at this Starbucks. As soon as I pulled up to order, the most genuine voice greeted me, took my order, and I pulled up to the second window to wait for my drink. My barista, Andy, with the same genuine voice greeted me again with a smile, handed me my drink and bid me good day. Sounds like a typical encounter at Starbucks but Andy really made my morning just with the genuine kindness in his voice. Thank you, sir :)",
                "useful":2,
                "user_id":"I70jgmMpKH7qgqr9va28Og"
            },
            {
                "cool":3,
                "date":"2014-12-14 15:43:31",
                "funny":1,
                "review_id":"rqkYqBhtdrQDeWZqYGv_ew",
                "stars":5,
                "text":"They have the Clover brewed coffees! We were flying out of Vegas and we needed a couple of refreshing brews on this hot, hot day. We picked this Starbucks specifically because it was not in a casino, was close to the strip and brewed clover coffee. Even though we didn't try a clover coffee, we wanted to check out the machine and the upscale coffees that are offered at stores with a clover machine. We were not disappointed as this Starbucks was replete with a plethora of exotic coffees. \nThe actual coffee shop was larger than many and had a number of sitting spaces.\n The clientele at the time we were there was eclectic and if you enjoy people watching, this is definitely the place to go.\nAnother plus for this location is that it has a drive through. \nThe barista was quick and delivered a couple of perfect coffees (one vanilla latte and one caramel macchiato).\nAnother wonderful experience at Starbucks.",
                "useful":3,
                "user_id":"diYbASjeqV4CxkoyeBeBGw"
            },
            {
                "cool":0,
                "date":"2016-03-04 20:35:13",
                "funny":0,
                "review_id":"qeRcHShexTRg8Z3kS_67jw",
                "stars":1,
                "text":"Long time Starbucks member, have a gold card, am at a Starbucks almost everyday. I Was planning to get a drink but I had to use the restroom first. The barista was extremely rude, and says, \"its only for paying customers\" with a smug look on her face. I would understand if it was someone who was homeless/ and or transient who was going to use the bathroom for other uses. But I am a student with a backpack here to get some work done, who just really had to pee first. Rude service.",
                "useful":0,
                "user_id":"kIRmhv_GAagDTI8CUAXIrg"
            },
            {
                "cool":0,
                "date":"2018-09-01 18:02:17",
                "funny":3,
                "review_id":"ftg29YGoHy49qgLMGNhs_w",
                "stars":3,
                "text":"Wow, I remember why I quit going to Starbucks. So expensive for a caffeine and sugar rush/crash. I'll stick to making it at home.",
                "useful":1,
                "user_id":"3oDWaCp5w40bGHYmrAofHw"
            },
            {
                "cool":0,
                "date":"2018-05-27 22:37:12",
                "funny":0,
                "review_id":"sPNQcJjbeNZXPU-3cf6O8A",
                "stars":3,
                "text":"***update***Brandon and Chris continue to give great service. Moved to Howard Hughs Blvd and have been using them for 3 months now and I get the best service and the BEST caramel fraps from Brandon.",
                "useful":0,
                "user_id":"EA-UgJmd-hQ8RBn1odmDJg"
            },
            {
                "cool":1,
                "date":"2016-08-02 21:05:16",
                "funny":2,
                "review_id":"5iiq0qgp0ZXlwl_93_umyg",
                "stars":1,
                "text":"Came in for coffee and my order was taken by Michele. She was rude and literally proceeded to yell at her coworker as soon as she finished ringing me up. What a bully. Will never return here.",
                "useful":4,
                "user_id":"6S0C4SwLyVgoIm0N93Mwcg"
            },
            {
                "cool":1,
                "date":"2018-09-12 23:50:18",
                "funny":0,
                "review_id":"_fa64REYF9ddaOSQr3FrXQ",
                "stars":5,
                "text":"This is absolutely my favorite STARBUCKS in Las Vegas!! And a place where people know me by name! What can I say? Awesome customer service, and not to mention the delicious and oh so irresistible coffee! I normally order a iced latte with coconut milk!! Their coconut is worth the extra money and its a great drink without the added pumps of sugar! I will say this location is a tad pricier given they have the same tax as the lv strip! Overall great location and customer service!!",
                "useful":1,
                "user_id":"23WZsw0pLiEMm1nHSqFlKg"
            }
        ]
    }
]
